var oracleData = {
  "time": "2026-06-12 21:32:32",
  "issue": "2026163",
  "code": "39,8,10,33,7,41,37",
  "zodiac": "龙,猪,鸡,狗,鼠,虎,马",
  "wave": "green,red,blue,green,red,blue,blue",
  "teSx": "马",
  "teWei": "7",
  "nextIssue": "2026164",
  "ninePool": [
    "猴",
    "鸡",
    "牛",
    "狗",
    "羊",
    "鼠",
    "虎",
    "龙",
    "兔"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "牛",
    "狗",
    "羊",
    "鼠"
  ],
  "killZodiacs": [
    "猴",
    "马"
  ],
  "rangeZodiacs": [
    "猴",
    "鸡",
    "牛",
    "狗",
    "羊",
    "鼠",
    "虎",
    "龙",
    "兔"
  ],
  "numbers": [
    23,
    34,
    6,
    33,
    24,
    43,
    35,
    45,
    10,
    30,
    46,
    36
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      35
    ],
    "鸡": [
      34,
      10,
      46
    ],
    "牛": [
      6,
      30
    ],
    "狗": [
      33,
      45
    ],
    "羊": [
      24,
      36
    ],
    "鼠": [
      43
    ]
  },
  "top7Tails": [
    3,
    4,
    5,
    0,
    6,
    7,
    8
  ],
  "dynamicRate9": 66.66666666666666,
  "dynamicRate6": 57.14285714285714
};