var oracleData = {
  "time": "2026-09-12 21:32:32",
  "issue": "2026255",
  "code": "36,22,6,47,39,11,44",
  "zodiac": "羊,鸡,牛,猴,龙,猴,猪",
  "wave": "blue,green,green,blue,green,green,green",
  "teSx": "猪",
  "teWei": "4",
  "nextIssue": "2026256",
  "ninePool": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "牛",
    "龙",
    "马",
    "狗"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "rangeZodiacs": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "牛",
    "龙",
    "马",
    "狗"
  ],
  "numbers": [
    7,
    5,
    24,
    11,
    34,
    6,
    31,
    41,
    35,
    17,
    47,
    19
  ],
  "zodiacNumMap": {
    "鼠": [
      7,
      31,
      19
    ],
    "虎": [
      5,
      41,
      17
    ],
    "羊": [
      24
    ],
    "猴": [
      11,
      35,
      47
    ],
    "鸡": [
      34
    ],
    "牛": [
      6
    ]
  },
  "top7Tails": [
    1,
    5,
    7,
    9,
    3,
    4,
    6
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001
};