var oracleData = {
  "time": "2026-10-27 21:32:32",
  "issue": "2026300",
  "code": "1,29,23,17,18,42,38",
  "zodiac": "马,虎,猴,虎,牛,牛,蛇",
  "wave": "red,red,red,green,red,blue,green",
  "teSx": "蛇",
  "teWei": "8",
  "nextIssue": "2026301",
  "ninePool": [
    "狗",
    "牛",
    "鸡",
    "虎",
    "兔",
    "羊",
    "龙",
    "鼠",
    "马"
  ],
  "sixPool": [
    "狗",
    "牛",
    "鸡",
    "虎",
    "兔",
    "羊"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "rangeZodiacs": [
    "狗",
    "牛",
    "鸡",
    "虎",
    "兔",
    "羊",
    "龙",
    "鼠",
    "马"
  ],
  "numbers": [
    9,
    42,
    22,
    29,
    4,
    12,
    21,
    41,
    34,
    24,
    30,
    10
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21
    ],
    "牛": [
      42,
      30
    ],
    "鸡": [
      22,
      34,
      10
    ],
    "虎": [
      29,
      41
    ],
    "兔": [
      4
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    1,
    2,
    4,
    9,
    0,
    6,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 48.0
};