var oracleData = {
  "time": "2026-07-05 21:32:32",
  "issue": "2026186",
  "code": "17,29,22,1,5,38,23",
  "zodiac": "虎,虎,鸡,马,虎,蛇,猴",
  "wave": "green,red,green,red,green,green,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026187",
  "ninePool": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "狗",
    "兔",
    "羊",
    "鸡"
  ],
  "sixPool": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "rangeZodiacs": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "狗",
    "兔",
    "羊",
    "鸡"
  ],
  "numbers": [
    32,
    17,
    3,
    2,
    13,
    33,
    27,
    37,
    20,
    5,
    15,
    25
  ],
  "zodiacNumMap": {
    "猪": [
      32,
      20
    ],
    "虎": [
      17,
      5
    ],
    "龙": [
      3,
      27,
      15
    ],
    "蛇": [
      2
    ],
    "马": [
      13,
      37,
      25
    ],
    "狗": [
      33
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    0,
    5,
    6,
    8
  ],
  "dynamicRate9": 81.81818181818183,
  "dynamicRate6": 65.9090909090909
};