var oracleData = {
  "time": "2026-08-23 21:32:32",
  "issue": "2026235",
  "code": "27,26,35,17,44,21,32",
  "zodiac": "龙,蛇,猴,虎,猪,狗,猪",
  "wave": "green,blue,red,green,green,green,green",
  "teSx": "猪",
  "teWei": "2",
  "nextIssue": "2026236",
  "ninePool": [
    "鸡",
    "羊",
    "牛",
    "虎",
    "兔",
    "蛇",
    "猴",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "牛",
    "虎",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "羊",
    "牛",
    "虎",
    "兔",
    "蛇",
    "猴",
    "鼠",
    "马"
  ],
  "numbers": [
    34,
    24,
    18,
    5,
    4,
    14,
    10,
    30,
    40,
    41,
    22,
    12
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      22
    ],
    "羊": [
      24,
      12
    ],
    "牛": [
      18,
      30
    ],
    "虎": [
      5,
      41
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    2,
    3,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 56.00000000000001
};