var oracleData = {
  "time": "2026-06-21 21:32:32",
  "issue": "2026172",
  "code": "28,34,42,37,45,8,44",
  "zodiac": "兔,鸡,牛,马,狗,猪,猪",
  "wave": "green,red,blue,blue,red,red,green",
  "teSx": "猪",
  "teWei": "4",
  "nextIssue": "2026173",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "蛇",
    "牛",
    "羊",
    "鼠",
    "龙",
    "马"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "蛇",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "虎",
    "蛇",
    "牛",
    "羊",
    "鼠",
    "龙",
    "马"
  ],
  "numbers": [
    10,
    11,
    5,
    2,
    30,
    12,
    41,
    22,
    42,
    34,
    14,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "猴": [
      11
    ],
    "虎": [
      5,
      41
    ],
    "蛇": [
      2,
      14
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    4,
    5,
    6,
    7
  ],
  "dynamicRate9": 76.66666666666667,
  "dynamicRate6": 56.666666666666664
};