var oracleData = {
  "time": "2026-06-06 21:32:32",
  "issue": "2026157",
  "code": "43,25,11,31,17,10,40",
  "zodiac": "鼠,马,猴,鼠,虎,鸡,兔",
  "wave": "green,blue,green,blue,green,blue,red",
  "teSx": "兔",
  "teWei": "0",
  "nextIssue": "2026158",
  "ninePool": [
    "鸡",
    "猪",
    "蛇",
    "龙",
    "羊",
    "狗",
    "猴",
    "虎",
    "马"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "蛇",
    "龙",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "兔",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "猪",
    "蛇",
    "龙",
    "羊",
    "狗",
    "猴",
    "虎",
    "马"
  ],
  "numbers": [
    10,
    20,
    2,
    3,
    12,
    9,
    22,
    32,
    34,
    44,
    14,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "猪": [
      20,
      32,
      44
    ],
    "蛇": [
      2,
      14
    ],
    "龙": [
      3
    ],
    "羊": [
      12,
      24
    ],
    "狗": [
      9
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    6,
    3,
    5,
    8
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 66.66666666666666
};