var oracleData = {
  "time": "2026-07-30 21:32:32",
  "issue": "2026211",
  "code": "13,12,39,37,38,8,1",
  "zodiac": "马,羊,龙,马,蛇,猪,马",
  "wave": "red,red,green,blue,green,red,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026212",
  "ninePool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猴",
    "鼠",
    "蛇",
    "兔",
    "猪"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "猴",
    "鼠",
    "蛇",
    "兔",
    "猪"
  ],
  "numbers": [
    6,
    34,
    24,
    21,
    11,
    7,
    46,
    36,
    30,
    10,
    31,
    42
  ],
  "zodiacNumMap": {
    "牛": [
      6,
      30,
      42
    ],
    "鸡": [
      34,
      46,
      10
    ],
    "羊": [
      24,
      36
    ],
    "狗": [
      21
    ],
    "猴": [
      11
    ],
    "鼠": [
      7,
      31
    ]
  },
  "top7Tails": [
    4,
    6,
    0,
    1,
    2,
    3,
    7
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 62.0
};