var oracleData = {
  "time": "2026-09-03 21:32:32",
  "issue": "2026246",
  "code": "22,24,19,10,20,1,30",
  "zodiac": "鸡,羊,鼠,鸡,猪,马,牛",
  "wave": "green,red,red,blue,blue,red,red",
  "teSx": "牛",
  "teWei": "0",
  "nextIssue": "2026247",
  "ninePool": [
    "猪",
    "鼠",
    "兔",
    "蛇",
    "马",
    "羊",
    "猴",
    "虎",
    "龙"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "兔",
    "蛇",
    "马",
    "羊"
  ],
  "killZodiacs": [
    "龙",
    "牛"
  ],
  "rangeZodiacs": [
    "猪",
    "鼠",
    "兔",
    "蛇",
    "马",
    "羊",
    "猴",
    "虎",
    "龙"
  ],
  "numbers": [
    20,
    43,
    4,
    14,
    13,
    24,
    40,
    44,
    32,
    2,
    12,
    25
  ],
  "zodiacNumMap": {
    "猪": [
      20,
      44,
      32
    ],
    "鼠": [
      43
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14,
      2
    ],
    "马": [
      13,
      25
    ],
    "羊": [
      24,
      12
    ]
  },
  "top7Tails": [
    0,
    3,
    4,
    2,
    5,
    6,
    8
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 52.0
};