var oracleData = {
  "time": "2026-05-26 21:32:32",
  "issue": "2026146",
  "code": "11,30,20,19,5,16,42",
  "zodiac": "猴,牛,猪,鼠,虎,兔,牛",
  "wave": "green,red,blue,red,green,green,blue",
  "teSx": "牛",
  "teWei": "2",
  "nextIssue": "2026147",
  "ninePool": [
    "鸡",
    "龙",
    "兔",
    "蛇",
    "马",
    "羊",
    "虎",
    "猴",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "兔",
    "蛇",
    "马",
    "羊"
  ],
  "killZodiacs": [
    "狗",
    "牛"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "兔",
    "蛇",
    "马",
    "羊",
    "虎",
    "猴",
    "狗"
  ],
  "numbers": [
    10,
    27,
    40,
    2,
    1,
    12,
    22,
    37,
    15,
    25,
    28,
    38
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "龙": [
      27,
      15
    ],
    "兔": [
      40,
      28
    ],
    "蛇": [
      2,
      38
    ],
    "马": [
      1,
      37,
      25
    ],
    "羊": [
      12
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    7,
    5,
    8,
    9
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 50.0
};