var oracleData = {
  "time": "2026-10-16 21:32:32",
  "issue": "2026289",
  "code": "12,29,19,28,47,34,38",
  "zodiac": "羊,虎,鼠,兔,猴,鸡,蛇",
  "wave": "red,red,red,green,blue,red,green",
  "teSx": "蛇",
  "teWei": "8",
  "nextIssue": "2026290",
  "ninePool": [
    "兔",
    "虎",
    "鸡",
    "猪",
    "牛",
    "猴",
    "狗",
    "鼠",
    "龙"
  ],
  "sixPool": [
    "兔",
    "虎",
    "鸡",
    "猪",
    "牛",
    "猴"
  ],
  "killZodiacs": [
    "猪",
    "蛇"
  ],
  "rangeZodiacs": [
    "兔",
    "虎",
    "鸡",
    "猪",
    "牛",
    "猴",
    "狗",
    "鼠",
    "龙"
  ],
  "numbers": [
    16,
    17,
    46,
    32,
    6,
    11,
    41,
    47,
    22,
    42,
    23,
    4
  ],
  "zodiacNumMap": {
    "兔": [
      16,
      4
    ],
    "虎": [
      17,
      41
    ],
    "鸡": [
      46,
      22
    ],
    "猪": [
      32
    ],
    "牛": [
      6,
      42
    ],
    "猴": [
      11,
      47,
      23
    ]
  },
  "top7Tails": [
    1,
    6,
    7,
    2,
    3,
    4,
    9
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001
};