var oracleData = {
  "time": "2026-08-25 21:32:32",
  "issue": "2026237",
  "code": "47,36,14,6,41,25,12",
  "zodiac": "猴,羊,蛇,牛,虎,马,羊",
  "wave": "blue,blue,blue,green,blue,blue,red",
  "teSx": "羊",
  "teWei": "2",
  "nextIssue": "2026238",
  "ninePool": [
    "鸡",
    "马",
    "兔",
    "蛇",
    "牛",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "马",
    "兔",
    "蛇",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "rangeZodiacs": [
    "鸡",
    "马",
    "兔",
    "蛇",
    "牛",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "numbers": [
    34,
    25,
    4,
    14,
    18,
    5,
    10,
    40,
    30,
    1,
    41,
    13
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "马": [
      25,
      1,
      13
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14
    ],
    "牛": [
      18,
      30
    ],
    "虎": [
      5,
      41
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    3,
    7,
    8
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 52.0
};