var oracleData = {
  "time": "2026-10-18 21:32:32",
  "issue": "2026291",
  "code": "32,10,41,38,22,2,17",
  "zodiac": "猪,鸡,虎,蛇,鸡,蛇,虎",
  "wave": "green,blue,blue,green,green,red,green",
  "teSx": "虎",
  "teWei": "7",
  "nextIssue": "2026292",
  "ninePool": [
    "狗",
    "龙",
    "猪",
    "鼠",
    "猴",
    "蛇",
    "鸡",
    "牛",
    "羊"
  ],
  "sixPool": [
    "狗",
    "龙",
    "猪",
    "鼠",
    "猴",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "rangeZodiacs": [
    "狗",
    "龙",
    "猪",
    "鼠",
    "猴",
    "蛇",
    "鸡",
    "牛",
    "羊"
  ],
  "numbers": [
    21,
    27,
    32,
    7,
    11,
    26,
    31,
    47,
    2,
    33,
    3,
    43
  ],
  "zodiacNumMap": {
    "狗": [
      21,
      33
    ],
    "龙": [
      27,
      3
    ],
    "猪": [
      32
    ],
    "鼠": [
      7,
      31,
      43
    ],
    "猴": [
      11,
      47
    ],
    "蛇": [
      26,
      2
    ]
  },
  "top7Tails": [
    1,
    6,
    7,
    2,
    3,
    4,
    5
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};