var oracleData = {
  "time": "2026-07-14 21:32:32",
  "issue": "2026195",
  "code": "46,23,39,4,9,19,25",
  "zodiac": "鸡,猴,龙,兔,狗,鼠,马",
  "wave": "red,red,green,blue,blue,red,blue",
  "teSx": "马",
  "teWei": "5",
  "nextIssue": "2026196",
  "ninePool": [
    "猪",
    "鼠",
    "牛",
    "狗",
    "虎",
    "龙",
    "羊",
    "鸡",
    "兔"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "牛",
    "狗",
    "虎",
    "龙"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "rangeZodiacs": [
    "猪",
    "鼠",
    "牛",
    "狗",
    "虎",
    "龙",
    "羊",
    "鸡",
    "兔"
  ],
  "numbers": [
    8,
    7,
    18,
    21,
    17,
    27,
    20,
    30,
    32,
    42,
    44,
    31
  ],
  "zodiacNumMap": {
    "猪": [
      8,
      20,
      32,
      44
    ],
    "鼠": [
      7,
      31
    ],
    "牛": [
      18,
      30,
      42
    ],
    "狗": [
      21
    ],
    "虎": [
      17
    ],
    "龙": [
      27
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    7,
    8,
    1,
    3
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 68.0
};