var oracleData = {
  "time": "2026-07-26 21:32:32",
  "issue": "2026207",
  "code": "9,40,26,23,44,13,31",
  "zodiac": "狗,兔,蛇,猴,猪,马,鼠",
  "wave": "blue,red,blue,red,green,red,blue",
  "teSx": "鼠",
  "teWei": "1",
  "nextIssue": "2026208",
  "ninePool": [
    "牛",
    "鸡",
    "狗",
    "虎",
    "龙",
    "马",
    "羊",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "狗",
    "虎",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "鼠",
    "鼠"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "狗",
    "虎",
    "龙",
    "马",
    "羊",
    "蛇",
    "兔"
  ],
  "numbers": [
    6,
    34,
    21,
    41,
    3,
    1,
    30,
    10,
    42,
    22,
    33,
    13
  ],
  "zodiacNumMap": {
    "牛": [
      6,
      30,
      42
    ],
    "鸡": [
      34,
      10,
      22
    ],
    "狗": [
      21,
      33
    ],
    "虎": [
      41
    ],
    "龙": [
      3
    ],
    "马": [
      1,
      13
    ]
  },
  "top7Tails": [
    1,
    4,
    0,
    2,
    3,
    6,
    8
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 62.0
};