var oracleData = {
  "time": "2026-09-19 21:32:32",
  "issue": "2026262",
  "code": "38,22,33,47,36,7,30",
  "zodiac": "蛇,鸡,狗,猴,羊,鼠,牛",
  "wave": "green,green,green,blue,blue,red,red",
  "teSx": "牛",
  "teWei": "0",
  "nextIssue": "2026263",
  "ninePool": [
    "龙",
    "虎",
    "鸡",
    "猪",
    "鼠",
    "蛇",
    "兔",
    "猴",
    "狗"
  ],
  "sixPool": [
    "龙",
    "虎",
    "鸡",
    "猪",
    "鼠",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "rangeZodiacs": [
    "龙",
    "虎",
    "鸡",
    "猪",
    "鼠",
    "蛇",
    "兔",
    "猴",
    "狗"
  ],
  "numbers": [
    3,
    5,
    10,
    8,
    19,
    38,
    43,
    15,
    39,
    29,
    20,
    41
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      15,
      39
    ],
    "虎": [
      5,
      29,
      41
    ],
    "鸡": [
      10
    ],
    "猪": [
      8,
      20
    ],
    "鼠": [
      19,
      43
    ],
    "蛇": [
      38
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    9,
    0,
    1,
    7
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 56.00000000000001
};