var oracleData = {
  "time": "2026-09-22 21:32:32",
  "issue": "2026265",
  "code": "5,46,40,23,26,44,49",
  "zodiac": "虎,鸡,兔,猴,蛇,猪,马",
  "wave": "green,red,red,red,blue,green,green",
  "teSx": "马",
  "teWei": "9",
  "nextIssue": "2026266",
  "ninePool": [
    "龙",
    "虎",
    "猴",
    "羊",
    "鼠",
    "牛",
    "蛇",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "龙",
    "虎",
    "猴",
    "羊",
    "鼠",
    "牛"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "rangeZodiacs": [
    "龙",
    "虎",
    "猴",
    "羊",
    "鼠",
    "牛",
    "蛇",
    "鸡",
    "猪"
  ],
  "numbers": [
    3,
    5,
    23,
    48,
    43,
    18,
    15,
    35,
    12,
    42,
    36,
    6
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      15
    ],
    "虎": [
      5
    ],
    "猴": [
      23,
      35
    ],
    "羊": [
      48,
      12,
      36
    ],
    "鼠": [
      43
    ],
    "牛": [
      18,
      42,
      6
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    2,
    6,
    7,
    9
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 56.00000000000001
};