var oracleData = {
  "time": "2026-06-26 21:32:32",
  "issue": "2026177",
  "code": "19,21,5,1,2,44,14",
  "zodiac": "鼠,狗,虎,马,蛇,猪,蛇",
  "wave": "red,green,green,red,red,green,blue",
  "teSx": "蛇",
  "teWei": "4",
  "nextIssue": "2026178",
  "ninePool": [
    "猴",
    "牛",
    "羊",
    "鸡",
    "猪",
    "马",
    "狗",
    "龙",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "牛",
    "羊",
    "鸡",
    "猪",
    "马"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "rangeZodiacs": [
    "猴",
    "牛",
    "羊",
    "鸡",
    "猪",
    "马",
    "狗",
    "龙",
    "鼠"
  ],
  "numbers": [
    47,
    42,
    12,
    22,
    32,
    37,
    30,
    10,
    20,
    11,
    1,
    23
  ],
  "zodiacNumMap": {
    "猴": [
      47,
      11,
      23
    ],
    "牛": [
      42,
      30
    ],
    "羊": [
      12
    ],
    "鸡": [
      22,
      10
    ],
    "猪": [
      32,
      20
    ],
    "马": [
      37,
      1
    ]
  },
  "top7Tails": [
    2,
    7,
    0,
    1,
    3,
    5,
    8
  ],
  "dynamicRate9": 77.14285714285715,
  "dynamicRate6": 60.0
};