var oracleData = {
  "time": "2026-08-12 21:32:32",
  "issue": "2026224",
  "code": "25,19,8,49,18,36,9",
  "zodiac": "马,鼠,猪,马,牛,羊,狗",
  "wave": "blue,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": "9",
  "nextIssue": "2026225",
  "ninePool": [
    "鸡",
    "龙",
    "虎",
    "兔",
    "马",
    "牛",
    "猪",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "虎",
    "兔",
    "马",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "虎",
    "兔",
    "马",
    "牛",
    "猪",
    "蛇",
    "羊"
  ],
  "numbers": [
    10,
    15,
    5,
    40,
    25,
    30,
    22,
    42,
    39,
    29,
    41,
    1
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "龙": [
      15,
      39
    ],
    "虎": [
      5,
      29,
      41
    ],
    "兔": [
      40
    ],
    "马": [
      25,
      1
    ],
    "牛": [
      30,
      42
    ]
  },
  "top7Tails": [
    0,
    2,
    5,
    9,
    1,
    8,
    3
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 57.99999999999999
};