var oracleData = {
  "time": "2026-09-14 21:32:32",
  "issue": "2026257",
  "code": "8,46,47,39,27,45,7",
  "zodiac": "猪,鸡,猴,龙,龙,狗,鼠",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "鼠",
  "teWei": "7",
  "nextIssue": "2026258",
  "ninePool": [
    "龙",
    "羊",
    "狗",
    "虎",
    "马",
    "猴",
    "蛇",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "龙",
    "羊",
    "狗",
    "虎",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "rangeZodiacs": [
    "龙",
    "羊",
    "狗",
    "虎",
    "马",
    "猴",
    "蛇",
    "鸡",
    "猪"
  ],
  "numbers": [
    15,
    48,
    9,
    5,
    25,
    35,
    45,
    27,
    17,
    37,
    47,
    39
  ],
  "zodiacNumMap": {
    "龙": [
      15,
      27,
      39
    ],
    "羊": [
      48
    ],
    "狗": [
      9,
      45
    ],
    "虎": [
      5,
      17
    ],
    "马": [
      25,
      37
    ],
    "猴": [
      35,
      47
    ]
  },
  "top7Tails": [
    5,
    7,
    8,
    9,
    1,
    3,
    6
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001
};