var oracleData = {
  "time": "2026-08-17 21:32:32",
  "issue": "2026229",
  "code": "11,7,15,13,33,16,38",
  "zodiac": "猴,鼠,龙,马,狗,兔,蛇",
  "wave": "green,red,blue,red,green,green,green",
  "teSx": "蛇",
  "teWei": "8",
  "nextIssue": "2026230",
  "ninePool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "虎",
    "羊",
    "狗",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "猪",
    "牛",
    "虎",
    "羊",
    "狗",
    "鼠",
    "马"
  ],
  "numbers": [
    10,
    15,
    20,
    30,
    5,
    12,
    22,
    32,
    42,
    34,
    44,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "龙": [
      15
    ],
    "猪": [
      20,
      32,
      44
    ],
    "牛": [
      30,
      42
    ],
    "虎": [
      5
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    7,
    8,
    9
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 56.00000000000001
};