var oracleData = {
  "time": "2026-06-14 21:32:32",
  "issue": "2026165",
  "code": "11,47,9,49,2,1,3",
  "zodiac": "猴,猴,狗,马,蛇,马,龙",
  "wave": "green,blue,blue,green,red,red,blue",
  "teSx": "龙",
  "teWei": "3",
  "nextIssue": "2026166",
  "ninePool": [
    "鸡",
    "猴",
    "马",
    "狗",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "马",
    "狗",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "马",
    "狗",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "numbers": [
    34,
    23,
    13,
    33,
    43,
    24,
    35,
    25,
    45,
    10,
    46,
    36
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      46
    ],
    "猴": [
      23,
      35
    ],
    "马": [
      13,
      25
    ],
    "狗": [
      33,
      45
    ],
    "鼠": [
      43
    ],
    "羊": [
      24,
      36
    ]
  },
  "top7Tails": [
    3,
    4,
    5,
    0,
    6,
    8,
    9
  ],
  "dynamicRate9": 69.56521739130434,
  "dynamicRate6": 56.52173913043478
};