var oracleData = {
  "time": "2026-06-28 21:32:32",
  "issue": "2026179",
  "code": "10,11,26,6,31,9,15",
  "zodiac": "鸡,猴,蛇,牛,鼠,狗,龙",
  "wave": "blue,green,blue,green,blue,blue,blue",
  "teSx": "龙",
  "teWei": "5",
  "nextIssue": "2026180",
  "ninePool": [
    "猴",
    "鼠",
    "狗",
    "马",
    "虎",
    "兔",
    "猪",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "狗",
    "马",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "rangeZodiacs": [
    "猴",
    "鼠",
    "狗",
    "马",
    "虎",
    "兔",
    "猪",
    "蛇",
    "羊"
  ],
  "numbers": [
    35,
    7,
    9,
    25,
    5,
    40,
    45,
    47,
    37,
    17,
    19,
    29
  ],
  "zodiacNumMap": {
    "猴": [
      35,
      47
    ],
    "鼠": [
      7,
      19
    ],
    "狗": [
      9,
      45
    ],
    "马": [
      25,
      37
    ],
    "虎": [
      5,
      17,
      29
    ],
    "兔": [
      40
    ]
  },
  "top7Tails": [
    2,
    5,
    7,
    9,
    0,
    1,
    3
  ],
  "dynamicRate9": 78.37837837837837,
  "dynamicRate6": 62.16216216216216
};