var oracleData = {
  "time": "2026-05-21 21:32:32",
  "issue": "2026141",
  "code": "43,8,17,2,34,32,33",
  "zodiac": "鼠,猪,虎,蛇,鸡,猪,狗",
  "wave": "green,red,green,red,red,green,green",
  "teSx": "狗",
  "teWei": 3,
  "nextIssue": "2026142",
  "ninePool": [
    "猪",
    "猴",
    "虎",
    "鸡",
    "龙",
    "牛",
    "鼠",
    "马",
    "兔"
  ],
  "sixPool": [
    "猪",
    "猴",
    "虎",
    "鸡",
    "龙",
    "牛"
  ],
  "goldVotes": {
    "狗": 4,
    "鸡": 4,
    "羊": 5,
    "马": 4,
    "兔": 4,
    "鼠": 7,
    "蛇": 4,
    "猪": 1,
    "猴": 5,
    "龙": 6,
    "虎": 3,
    "牛": 2
  },
  "missing": {
    "马": 3,
    "羊": 2,
    "猴": 22,
    "鸡": 18,
    "狗": 0,
    "猪": 20,
    "鼠": 8,
    "牛": 6,
    "虎": 11,
    "兔": 1,
    "龙": 17,
    "蛇": 4
  },
  "fixedKillSet": [
    "猴",
    "狗"
  ],
  "teKillSet": [],
  "l3KillSet": [
    "蛇",
    "猪",
    "兔",
    "鸡",
    "虎",
    "牛",
    "龙",
    "鼠",
    "羊",
    "猴"
  ],
  "oraclePool": [
    "猪",
    "蛇",
    "兔",
    "鸡",
    "虎",
    "牛",
    "龙",
    "鼠",
    "狗"
  ],
  "hechongPool": [
    "兔",
    "鸡",
    "虎",
    "龙",
    "鼠",
    "狗",
    "猴",
    "马"
  ],
  "dynamicRate9": 0,
  "dynamicRate6": 0
};