var oracleData = {
  "time": "2026-07-29 21:32:32",
  "issue": "2026210",
  "code": "40,37,15,17,42,48,49",
  "zodiac": "兔,马,龙,虎,牛,羊,马",
  "wave": "red,blue,blue,green,blue,blue,green",
  "teSx": "马",
  "teWei": "9",
  "nextIssue": "2026211",
  "ninePool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "虎",
    "龙",
    "猴",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "虎",
    "龙"
  ],
  "killZodiacs": [
    "兔",
    "马"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "羊",
    "狗",
    "虎",
    "龙",
    "猴",
    "蛇",
    "兔"
  ],
  "numbers": [
    6,
    34,
    24,
    21,
    17,
    3,
    46,
    36,
    30,
    10,
    41,
    42
  ],
  "zodiacNumMap": {
    "牛": [
      6,
      30,
      42
    ],
    "鸡": [
      34,
      46,
      10
    ],
    "羊": [
      24,
      36
    ],
    "狗": [
      21
    ],
    "虎": [
      17,
      41
    ],
    "龙": [
      3
    ]
  },
  "top7Tails": [
    4,
    6,
    0,
    1,
    2,
    3,
    7
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 64.0
};