var oracleData = {
  "time": "2026-08-05 21:32:32",
  "issue": "2026217",
  "code": "34,12,11,30,42,7,26",
  "zodiac": "鸡,羊,猴,牛,牛,鼠,蛇",
  "wave": "red,red,green,red,blue,red,blue",
  "teSx": "蛇",
  "teWei": "6",
  "nextIssue": "2026218",
  "ninePool": [
    "鸡",
    "狗",
    "虎",
    "羊",
    "兔",
    "猴",
    "龙",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "虎",
    "羊",
    "兔",
    "猴"
  ],
  "killZodiacs": [
    "龙",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "虎",
    "羊",
    "兔",
    "猴",
    "龙",
    "鼠",
    "马"
  ],
  "numbers": [
    10,
    33,
    5,
    12,
    40,
    23,
    22,
    45,
    35,
    46,
    36,
    16
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      46
    ],
    "狗": [
      33,
      45
    ],
    "虎": [
      5
    ],
    "羊": [
      12,
      36
    ],
    "兔": [
      40,
      16
    ],
    "猴": [
      23,
      35
    ]
  },
  "top7Tails": [
    0,
    2,
    3,
    5,
    6,
    7,
    8
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 60.0
};