var oracleData = {
  "time": "2026-08-30 21:32:32",
  "issue": "2026242",
  "code": "29,35,46,32,13,31,9",
  "zodiac": "虎,猴,鸡,猪,马,鼠,狗",
  "wave": "red,red,red,green,red,blue,blue",
  "teSx": "狗",
  "teWei": "9",
  "nextIssue": "2026243",
  "ninePool": [
    "鸡",
    "兔",
    "猴",
    "鼠",
    "虎",
    "蛇",
    "羊",
    "猪",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "猴",
    "鼠",
    "虎",
    "蛇"
  ],
  "killZodiacs": [
    "蛇",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "猴",
    "鼠",
    "虎",
    "蛇",
    "羊",
    "猪",
    "牛"
  ],
  "numbers": [
    10,
    4,
    23,
    43,
    5,
    14,
    40,
    34,
    46,
    16,
    26,
    28
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46
    ],
    "兔": [
      4,
      40,
      16,
      28
    ],
    "猴": [
      23
    ],
    "鼠": [
      43
    ],
    "虎": [
      5
    ],
    "蛇": [
      14,
      26
    ]
  },
  "top7Tails": [
    0,
    3,
    4,
    6,
    8,
    1,
    5
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 50.0
};