var oracleData = {
  "time": "2026-06-25 21:32:32",
  "issue": "2026176",
  "code": "30,31,2,36,38,15,10",
  "zodiac": "牛,鼠,蛇,羊,蛇,龙,鸡",
  "wave": "red,blue,red,blue,green,blue,blue",
  "teSx": "鸡",
  "teWei": "0",
  "nextIssue": "2026177",
  "ninePool": [
    "猴",
    "狗",
    "蛇",
    "羊",
    "龙",
    "猪",
    "牛",
    "马",
    "鼠"
  ],
  "sixPool": [
    "猴",
    "狗",
    "蛇",
    "羊",
    "龙",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "rangeZodiacs": [
    "猴",
    "狗",
    "蛇",
    "羊",
    "龙",
    "猪",
    "牛",
    "马",
    "鼠"
  ],
  "numbers": [
    47,
    9,
    2,
    12,
    27,
    20,
    32,
    11,
    21,
    23,
    33,
    3
  ],
  "zodiacNumMap": {
    "猴": [
      47,
      11,
      23
    ],
    "狗": [
      9,
      21,
      33
    ],
    "蛇": [
      2
    ],
    "羊": [
      12
    ],
    "龙": [
      27,
      3
    ],
    "猪": [
      20,
      32
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    1,
    3,
    5,
    8
  ],
  "dynamicRate9": 76.47058823529412,
  "dynamicRate6": 58.82352941176471
};