var oracleData = {
  "time": "2026-05-21 21:32:32",
  "issue": "2026141",
  "code": "43,8,17,2,34,32,33",
  "zodiac": "鼠,猪,虎,蛇,鸡,猪,狗",
  "wave": "green,red,green,red,red,green,green",
  "teSx": "狗",
  "teWei": "3",
  "nextIssue": "2026142",
  "ninePool": [
    "鸡",
    "狗",
    "猪",
    "鼠",
    "牛",
    "虎",
    "猴",
    "龙",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "虎",
    "龙",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "猴",
    "狗"
  ],
  "rangeZodiacs": [
    "猪",
    "鸡",
    "龙",
    "虎",
    "鼠",
    "牛",
    "蛇",
    "马",
    "羊",
    "兔"
  ],
  "numbers": [
    11,
    32,
    22,
    3,
    21,
    5,
    41,
    23,
    33,
    35,
    15,
    45
  ],
  "zodiacNumMap": {
    "猴": [
      11,
      23,
      35
    ],
    "猪": [
      32
    ],
    "鸡": [
      22
    ],
    "龙": [
      3,
      15
    ],
    "狗": [
      21,
      33,
      45
    ],
    "虎": [
      5,
      41
    ]
  },
  "top7Tails": [
    1,
    2,
    3,
    5,
    4,
    8,
    9
  ],
  "dynamicRate9": 0,
  "dynamicRate6": 0
};