var oracleData = {
  "time": "2026-06-19 21:32:32",
  "issue": "2026170",
  "code": "27,46,6,38,20,34,3",
  "zodiac": "龙,鸡,牛,蛇,猪,鸡,龙",
  "wave": "green,red,green,green,blue,red,blue",
  "teSx": "龙",
  "teWei": "3",
  "nextIssue": "2026171",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "鼠",
    "马",
    "猪",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "鼠",
    "马"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "鼠",
    "马",
    "猪",
    "牛",
    "蛇"
  ],
  "numbers": [
    10,
    11,
    5,
    40,
    7,
    1,
    41,
    31,
    23,
    43,
    13,
    34
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34
    ],
    "猴": [
      11,
      23
    ],
    "虎": [
      5,
      41
    ],
    "兔": [
      40
    ],
    "鼠": [
      7,
      31,
      43
    ],
    "马": [
      1,
      13
    ]
  },
  "top7Tails": [
    0,
    1,
    3,
    4,
    5,
    6,
    7
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 57.14285714285714
};