var oracleData = {
  "time": "2026-09-25 21:32:32",
  "issue": "2026268",
  "code": "48,34,11,21,19,36,40",
  "zodiac": "羊,鸡,猴,狗,鼠,羊,兔",
  "wave": "blue,red,green,green,red,blue,red",
  "teSx": "兔",
  "teWei": "0",
  "nextIssue": "2026269",
  "ninePool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "羊",
    "鼠",
    "猴",
    "马"
  ],
  "sixPool": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "兔"
  ],
  "rangeZodiacs": [
    "龙",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "羊",
    "鼠",
    "猴",
    "马"
  ],
  "numbers": [
    3,
    5,
    2,
    6,
    22,
    12,
    15,
    27,
    17,
    41,
    42,
    14
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      15,
      27
    ],
    "虎": [
      5,
      17,
      41
    ],
    "蛇": [
      2,
      14
    ],
    "牛": [
      6,
      42
    ],
    "鸡": [
      22
    ],
    "羊": [
      12
    ]
  },
  "top7Tails": [
    3,
    5,
    7,
    1,
    2,
    4,
    6
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};