var oracleData = {
  "time": "2026-09-28 21:32:32",
  "issue": "2026271",
  "code": "25,2,5,22,20,31,35",
  "zodiac": "马,蛇,虎,鸡,猪,鼠,猴",
  "wave": "blue,red,green,green,blue,blue,red",
  "teSx": "猴",
  "teWei": "5",
  "nextIssue": "2026272",
  "ninePool": [
    "虎",
    "龙",
    "蛇",
    "猪",
    "狗",
    "马",
    "牛",
    "兔",
    "羊"
  ],
  "sixPool": [
    "虎",
    "龙",
    "蛇",
    "猪",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "rangeZodiacs": [
    "虎",
    "龙",
    "蛇",
    "猪",
    "狗",
    "马",
    "牛",
    "兔",
    "羊"
  ],
  "numbers": [
    5,
    3,
    26,
    8,
    33,
    13,
    15,
    45,
    25,
    17,
    27,
    37
  ],
  "zodiacNumMap": {
    "虎": [
      5,
      17
    ],
    "龙": [
      3,
      15,
      27
    ],
    "蛇": [
      26
    ],
    "猪": [
      8
    ],
    "狗": [
      33,
      45
    ],
    "马": [
      13,
      25,
      37
    ]
  },
  "top7Tails": [
    3,
    5,
    6,
    7,
    1,
    2,
    4
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 54.0
};