var oracleData = {
  "time": "2026-06-09 21:32:32",
  "issue": "2026160",
  "code": "8,16,26,1,29,30,2",
  "zodiac": "猪,兔,蛇,马,虎,牛,蛇",
  "wave": "red,green,blue,red,red,red,red",
  "teSx": "蛇",
  "teWei": "2",
  "nextIssue": "2026161",
  "ninePool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔",
    "马",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "猴",
    "虎"
  ],
  "killZodiacs": [
    "鼠",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔",
    "马",
    "狗"
  ],
  "numbers": [
    22,
    8,
    18,
    12,
    23,
    5,
    32,
    42,
    34,
    44,
    24,
    48
  ],
  "zodiacNumMap": {
    "鸡": [
      22,
      34
    ],
    "猪": [
      8,
      32,
      44
    ],
    "牛": [
      18,
      42
    ],
    "羊": [
      12,
      24,
      48
    ],
    "猴": [
      23
    ],
    "虎": [
      5
    ]
  },
  "top7Tails": [
    2,
    3,
    4,
    8,
    0,
    5,
    6
  ],
  "dynamicRate9": 66.66666666666666,
  "dynamicRate6": 55.55555555555556
};