var oracleData = {
  "time": "2026-09-20 21:32:32",
  "issue": "2026263",
  "code": "44,28,3,2,24,13,9",
  "zodiac": "猪,兔,龙,蛇,羊,马,狗",
  "wave": "green,green,blue,red,red,red,blue",
  "teSx": "狗",
  "teWei": "9",
  "nextIssue": "2026264",
  "ninePool": [
    "龙",
    "虎",
    "猴",
    "鸡",
    "鼠",
    "兔",
    "羊",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "龙",
    "虎",
    "猴",
    "鸡",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "rangeZodiacs": [
    "龙",
    "虎",
    "猴",
    "鸡",
    "鼠",
    "兔",
    "羊",
    "蛇",
    "猪"
  ],
  "numbers": [
    3,
    5,
    23,
    10,
    19,
    28,
    43,
    15,
    35,
    39,
    29,
    41
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      15,
      39
    ],
    "虎": [
      5,
      29,
      41
    ],
    "猴": [
      23,
      35
    ],
    "鸡": [
      10
    ],
    "鼠": [
      19,
      43
    ],
    "兔": [
      28
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    9,
    1,
    7,
    0
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 57.99999999999999
};