var oracleData = {
  "time": "2026-10-14 21:32:32",
  "issue": "2026287",
  "code": "19,47,38,35,6,17,8",
  "zodiac": "鼠,猴,蛇,猴,牛,虎,猪",
  "wave": "red,blue,green,red,green,green,red",
  "teSx": "猪",
  "teWei": "8",
  "nextIssue": "2026288",
  "ninePool": [
    "马",
    "虎",
    "兔",
    "牛",
    "蛇",
    "羊",
    "猴",
    "鸡",
    "龙"
  ],
  "sixPool": [
    "马",
    "虎",
    "兔",
    "牛",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "猪"
  ],
  "rangeZodiacs": [
    "马",
    "虎",
    "兔",
    "牛",
    "蛇",
    "羊",
    "猴",
    "鸡",
    "龙"
  ],
  "numbers": [
    37,
    17,
    16,
    6,
    26,
    36,
    1,
    41,
    13,
    4,
    14,
    24
  ],
  "zodiacNumMap": {
    "马": [
      37,
      1,
      13
    ],
    "虎": [
      17,
      41
    ],
    "兔": [
      16,
      4
    ],
    "牛": [
      6
    ],
    "蛇": [
      26,
      14
    ],
    "羊": [
      36,
      24
    ]
  },
  "top7Tails": [
    6,
    7,
    1,
    3,
    4,
    5,
    8
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};