var oracleData = {
  "time": "2026-06-04 21:32:32",
  "issue": "2026155",
  "code": "21,37,46,13,40,47,7",
  "zodiac": "狗,马,鸡,马,兔,猴,鼠",
  "wave": "green,blue,red,red,red,blue,red",
  "teSx": "鼠",
  "teWei": "7",
  "nextIssue": "2026156",
  "ninePool": [
    "鸡",
    "猴",
    "龙",
    "马",
    "羊",
    "狗",
    "兔",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "龙",
    "马",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "兔",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "龙",
    "马",
    "羊",
    "狗",
    "兔",
    "蛇",
    "猪"
  ],
  "numbers": [
    10,
    23,
    3,
    13,
    24,
    9,
    34,
    46,
    36,
    22,
    12,
    33
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46,
      22
    ],
    "猴": [
      23
    ],
    "龙": [
      3
    ],
    "马": [
      13
    ],
    "羊": [
      24,
      36,
      12
    ],
    "狗": [
      9,
      33
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    3,
    7,
    8
  ],
  "dynamicRate9": 76.92307692307693,
  "dynamicRate6": 61.53846153846154
};