var oracleData = {
  "time": "2026-06-16 21:32:32",
  "issue": "2026167",
  "code": "23,3,40,39,7,11,19",
  "zodiac": "猴,龙,兔,龙,鼠,猴,鼠",
  "wave": "red,blue,red,green,red,green,red",
  "teSx": "鼠",
  "teWei": "9",
  "nextIssue": "2026168",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "龙",
    "马",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "牛",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "龙",
    "马",
    "猪",
    "兔",
    "蛇"
  ],
  "numbers": [
    34,
    35,
    5,
    24,
    15,
    25,
    10,
    11,
    41,
    1,
    23,
    3
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "猴": [
      35,
      11,
      23
    ],
    "虎": [
      5,
      41
    ],
    "羊": [
      24
    ],
    "龙": [
      15,
      3
    ],
    "马": [
      25,
      1
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    3,
    7,
    8
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 56.00000000000001
};