var oracleData = {
  "time": "2026-07-22 21:32:32",
  "issue": "2026203",
  "code": "12,11,31,3,44,37,25",
  "zodiac": "羊,猴,鼠,龙,猪,马,马",
  "wave": "red,green,blue,blue,green,blue,blue",
  "teSx": "马",
  "teWei": "5",
  "nextIssue": "2026204",
  "ninePool": [
    "牛",
    "鸡",
    "虎",
    "猴",
    "鼠",
    "龙",
    "狗",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "虎",
    "猴",
    "鼠",
    "龙"
  ],
  "killZodiacs": [
    "蛇",
    "马"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "虎",
    "猴",
    "鼠",
    "龙",
    "狗",
    "羊",
    "蛇"
  ],
  "numbers": [
    18,
    34,
    41,
    11,
    31,
    3,
    23,
    43,
    30,
    10,
    42,
    22
  ],
  "zodiacNumMap": {
    "牛": [
      18,
      30,
      42
    ],
    "鸡": [
      34,
      10,
      22
    ],
    "虎": [
      41
    ],
    "猴": [
      11,
      23
    ],
    "鼠": [
      31,
      43
    ],
    "龙": [
      3
    ]
  },
  "top7Tails": [
    1,
    3,
    4,
    0,
    2,
    5,
    7
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 64.0
};