var oracleData = {
  "time": "2026-10-12 21:32:32",
  "issue": "2026285",
  "code": "46,45,43,39,20,40,19",
  "zodiac": "鸡,狗,鼠,龙,猪,兔,鼠",
  "wave": "red,red,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": "9",
  "nextIssue": "2026286",
  "ninePool": [
    "羊",
    "狗",
    "马",
    "牛",
    "虎",
    "龙",
    "兔",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "羊",
    "狗",
    "马",
    "牛",
    "虎",
    "龙"
  ],
  "killZodiacs": [
    "羊",
    "鼠"
  ],
  "rangeZodiacs": [
    "羊",
    "狗",
    "马",
    "牛",
    "虎",
    "龙",
    "兔",
    "猪",
    "蛇"
  ],
  "numbers": [
    36,
    9,
    1,
    6,
    29,
    39,
    21,
    41,
    33,
    13,
    3,
    24
  ],
  "zodiacNumMap": {
    "羊": [
      36,
      24
    ],
    "狗": [
      9,
      21,
      33
    ],
    "马": [
      1,
      13
    ],
    "牛": [
      6
    ],
    "虎": [
      29,
      41
    ],
    "龙": [
      39,
      3
    ]
  },
  "top7Tails": [
    6,
    9,
    1,
    3,
    4,
    5,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 54.0
};