var oracleData = {
  "time": "2026-07-23 21:32:32",
  "issue": "2026204",
  "code": "11,12,17,26,10,7,5",
  "zodiac": "猴,羊,虎,蛇,鸡,鼠,虎",
  "wave": "green,red,green,blue,blue,red,green",
  "teSx": "虎",
  "teWei": "5",
  "nextIssue": "2026205",
  "ninePool": [
    "鸡",
    "牛",
    "狗",
    "猴",
    "猪",
    "鼠",
    "龙",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "狗",
    "猴",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "龙",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "狗",
    "猴",
    "猪",
    "鼠",
    "龙",
    "蛇",
    "兔"
  ],
  "numbers": [
    34,
    18,
    21,
    11,
    44,
    31,
    33,
    23,
    43,
    10,
    30,
    20
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "牛": [
      18,
      30
    ],
    "狗": [
      21,
      33
    ],
    "猴": [
      11,
      23
    ],
    "猪": [
      44,
      20
    ],
    "鼠": [
      31,
      43
    ]
  },
  "top7Tails": [
    1,
    3,
    4,
    0,
    2,
    7,
    8
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 62.0
};