var oracleData = {
  "time": "2026-10-13 21:32:32",
  "issue": "2026286",
  "code": "37,49,28,8,29,1,24",
  "zodiac": "马,马,兔,猪,虎,马,羊",
  "wave": "blue,green,green,red,red,red,red",
  "teSx": "羊",
  "teWei": "4",
  "nextIssue": "2026287",
  "ninePool": [
    "马",
    "兔",
    "蛇",
    "牛",
    "鸡",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "sixPool": [
    "马",
    "兔",
    "蛇",
    "牛",
    "鸡",
    "虎"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "rangeZodiacs": [
    "马",
    "兔",
    "蛇",
    "牛",
    "鸡",
    "虎",
    "狗",
    "龙",
    "猴"
  ],
  "numbers": [
    37,
    16,
    26,
    6,
    46,
    17,
    1,
    41,
    13,
    4,
    14,
    34
  ],
  "zodiacNumMap": {
    "马": [
      37,
      1,
      13
    ],
    "兔": [
      16,
      4
    ],
    "蛇": [
      26,
      14
    ],
    "牛": [
      6
    ],
    "鸡": [
      46,
      34
    ],
    "虎": [
      17,
      41
    ]
  },
  "top7Tails": [
    6,
    7,
    1,
    3,
    4,
    5,
    8
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 54.0
};