var oracleData = {
  "time": "2026-07-12 21:32:32",
  "issue": "2026193",
  "code": "2,49,25,11,45,29,9",
  "zodiac": "蛇,马,马,猴,狗,虎,狗",
  "wave": "red,green,blue,green,red,red,blue",
  "teSx": "狗",
  "teWei": "9",
  "nextIssue": "2026194",
  "ninePool": [
    "猪",
    "鼠",
    "鸡",
    "虎",
    "兔",
    "龙",
    "牛",
    "蛇",
    "羊"
  ],
  "sixPool": [
    "猪",
    "鼠",
    "鸡",
    "虎",
    "兔",
    "龙"
  ],
  "killZodiacs": [
    "兔",
    "狗"
  ],
  "rangeZodiacs": [
    "猪",
    "鼠",
    "鸡",
    "虎",
    "兔",
    "龙",
    "牛",
    "蛇",
    "羊"
  ],
  "numbers": [
    8,
    7,
    10,
    17,
    28,
    27,
    20,
    40,
    32,
    22,
    43,
    3
  ],
  "zodiacNumMap": {
    "猪": [
      8,
      20,
      32
    ],
    "鼠": [
      7,
      43
    ],
    "鸡": [
      10,
      22
    ],
    "虎": [
      17
    ],
    "兔": [
      28,
      40
    ],
    "龙": [
      27,
      3
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    8,
    3,
    4,
    9
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 68.0
};