var oracleData = {
  "time": "2026-05-22 21:32:32",
  "issue": "2026142",
  "code": "45,15,26,21,18,35,23",
  "zodiac": "狗,龙,蛇,狗,牛,猴,猴",
  "wave": "red,blue,blue,green,red,red,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026143",
  "ninePool": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "鼠",
    "鸡",
    "兔",
    "羊"
  ],
  "sixPool": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "牛",
    "猴"
  ],
  "rangeZodiacs": [
    "猪",
    "虎",
    "龙",
    "蛇",
    "马",
    "鼠",
    "鸡",
    "兔",
    "羊"
  ],
  "numbers": [
    32,
    5,
    15,
    2,
    1,
    31,
    41,
    25,
    3,
    13,
    43,
    44
  ],
  "zodiacNumMap": {
    "猪": [
      32,
      44
    ],
    "虎": [
      5,
      41
    ],
    "龙": [
      15,
      3
    ],
    "蛇": [
      2
    ],
    "马": [
      1,
      25,
      13
    ],
    "鼠": [
      31,
      43
    ]
  },
  "top7Tails": [
    1,
    2,
    5,
    3,
    4,
    8,
    9
  ],
  "dynamicRate9": 0.0,
  "dynamicRate6": 0.0
};