var oracleData = {
  "time": "2026-09-30 21:32:32",
  "issue": "2026273",
  "code": "30,3,25,28,6,17,5",
  "zodiac": "牛,龙,马,兔,牛,虎,虎",
  "wave": "red,blue,blue,green,green,green,green",
  "teSx": "虎",
  "teWei": "5",
  "nextIssue": "2026274",
  "ninePool": [
    "龙",
    "狗",
    "蛇",
    "马",
    "猴",
    "牛",
    "羊",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "狗",
    "蛇",
    "马",
    "猴",
    "牛"
  ],
  "killZodiacs": [
    "牛",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "狗",
    "蛇",
    "马",
    "猴",
    "牛",
    "羊",
    "兔",
    "鸡"
  ],
  "numbers": [
    3,
    33,
    14,
    13,
    23,
    6,
    26,
    27,
    37,
    47,
    21,
    1
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      27
    ],
    "狗": [
      33,
      21
    ],
    "蛇": [
      14,
      26
    ],
    "马": [
      13,
      37,
      1
    ],
    "猴": [
      23,
      47
    ],
    "牛": [
      6
    ]
  },
  "top7Tails": [
    3,
    4,
    6,
    7,
    1,
    5,
    8
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};