var oracleData = {
  "time": "2026-08-26 21:32:32",
  "issue": "2026238",
  "code": "35,44,23,4,7,21,17",
  "zodiac": "猴,猪,猴,兔,鼠,狗,虎",
  "wave": "red,green,red,blue,red,green,green",
  "teSx": "虎",
  "teWei": "7",
  "nextIssue": "2026239",
  "ninePool": [
    "鸡",
    "狗",
    "马",
    "鼠",
    "龙",
    "蛇",
    "猴",
    "牛",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "马",
    "鼠",
    "龙",
    "蛇"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "马",
    "鼠",
    "龙",
    "蛇",
    "猴",
    "牛",
    "兔"
  ],
  "numbers": [
    34,
    45,
    25,
    7,
    15,
    14,
    10,
    21,
    1,
    31,
    33,
    13
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "狗": [
      45,
      21,
      33
    ],
    "马": [
      25,
      1,
      13
    ],
    "鼠": [
      7,
      31
    ],
    "龙": [
      15
    ],
    "蛇": [
      14
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    3,
    6,
    7
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 50.0
};