var oracleData = {
  "time": "2026-07-01 21:32:32",
  "issue": "2026182",
  "code": "15,23,9,45,24,39,41",
  "zodiac": "龙,猴,狗,狗,羊,龙,虎",
  "wave": "blue,red,blue,red,red,green,blue",
  "teSx": "虎",
  "teWei": "1",
  "nextIssue": "2026183",
  "ninePool": [
    "猴",
    "马",
    "狗",
    "猪",
    "蛇",
    "羊",
    "兔",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "猴",
    "马",
    "狗",
    "猪",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "rangeZodiacs": [
    "猴",
    "马",
    "狗",
    "猪",
    "蛇",
    "羊",
    "兔",
    "鸡",
    "牛"
  ],
  "numbers": [
    23,
    13,
    33,
    32,
    2,
    12,
    47,
    37,
    20,
    35,
    25,
    45
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      47,
      35
    ],
    "马": [
      13,
      37,
      25
    ],
    "狗": [
      33,
      45
    ],
    "猪": [
      32,
      20
    ],
    "蛇": [
      2
    ],
    "羊": [
      12
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    0,
    5,
    8,
    9
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 62.5
};