var oracleData = {
  "time": "2026-08-15 21:32:32",
  "issue": "2026227",
  "code": "23,24,29,7,13,31,16",
  "zodiac": "猴,羊,虎,鼠,马,鼠,兔",
  "wave": "red,red,red,red,red,blue,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026228",
  "ninePool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "狗",
    "马",
    "猴",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "龙",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "猪",
    "牛",
    "羊",
    "狗",
    "马",
    "猴",
    "鼠",
    "虎"
  ],
  "numbers": [
    10,
    20,
    30,
    12,
    45,
    25,
    22,
    32,
    42,
    34,
    44,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "猪": [
      20,
      32,
      44
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      12,
      24
    ],
    "狗": [
      45
    ],
    "马": [
      25
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    8,
    9,
    1
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 60.0
};