var oracleData = {
  "time": "2026-08-04 21:32:32",
  "issue": "2026216",
  "code": "18,41,32,44,36,45,37",
  "zodiac": "牛,虎,猪,猪,羊,狗,马",
  "wave": "red,blue,green,green,blue,red,blue",
  "teSx": "马",
  "teWei": "7",
  "nextIssue": "2026217",
  "ninePool": [
    "狗",
    "鸡",
    "羊",
    "虎",
    "猴",
    "鼠",
    "牛",
    "猪",
    "兔"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "羊",
    "虎",
    "猴",
    "鼠"
  ],
  "killZodiacs": [
    "猪",
    "马"
  ],
  "rangeZodiacs": [
    "狗",
    "鸡",
    "羊",
    "虎",
    "猴",
    "鼠",
    "牛",
    "猪",
    "兔"
  ],
  "numbers": [
    33,
    10,
    12,
    5,
    23,
    43,
    22,
    45,
    35,
    46,
    36,
    17
  ],
  "zodiacNumMap": {
    "狗": [
      33,
      45
    ],
    "鸡": [
      10,
      22,
      46
    ],
    "羊": [
      12,
      36
    ],
    "虎": [
      5,
      17
    ],
    "猴": [
      23,
      35
    ],
    "鼠": [
      43
    ]
  },
  "top7Tails": [
    0,
    2,
    3,
    5,
    6,
    7,
    8
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 60.0
};