var oracleData = {
  "time": "2026-05-29 21:32:32",
  "issue": "2026149",
  "code": "28,30,44,45,4,20,27",
  "zodiac": "兔,牛,猪,狗,兔,猪,龙",
  "wave": "green,red,green,red,blue,blue,green",
  "teSx": "龙",
  "teWei": "7",
  "nextIssue": "2026150",
  "ninePool": [
    "鸡",
    "兔",
    "鼠",
    "马",
    "猴",
    "狗",
    "蛇",
    "羊",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "鼠",
    "马",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "狗",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "鼠",
    "马",
    "猴",
    "狗",
    "蛇",
    "羊",
    "猪"
  ],
  "numbers": [
    10,
    40,
    7,
    1,
    11,
    9,
    31,
    21,
    37,
    47,
    19,
    22
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "兔": [
      40
    ],
    "鼠": [
      7,
      31,
      19
    ],
    "马": [
      1,
      37
    ],
    "猴": [
      11,
      47
    ],
    "狗": [
      9,
      21
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    9,
    2,
    5,
    6
  ],
  "dynamicRate9": 85.71428571428571,
  "dynamicRate6": 57.14285714285714
};