var oracleData = {
  "time": "2026-06-02 21:32:32",
  "issue": "2026153",
  "code": "1,38,33,28,6,40,41",
  "zodiac": "马,蛇,狗,兔,牛,兔,虎",
  "wave": "red,green,green,green,green,red,blue",
  "teSx": "虎",
  "teWei": "1",
  "nextIssue": "2026154",
  "ninePool": [
    "鸡",
    "蛇",
    "猴",
    "龙",
    "猪",
    "马",
    "兔",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猴",
    "龙",
    "猪",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "猴",
    "龙",
    "猪",
    "马",
    "兔",
    "牛",
    "羊"
  ],
  "numbers": [
    10,
    26,
    11,
    27,
    20,
    1,
    46,
    22,
    2,
    32,
    34,
    14
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      46,
      22,
      34
    ],
    "蛇": [
      26,
      2,
      14
    ],
    "猴": [
      11
    ],
    "龙": [
      27
    ],
    "猪": [
      20,
      32
    ],
    "马": [
      1
    ]
  },
  "top7Tails": [
    0,
    6,
    1,
    2,
    4,
    7,
    8
  ],
  "dynamicRate9": 81.81818181818183,
  "dynamicRate6": 63.63636363636363
};