var oracleData = {
  "time": "2026-06-18 21:32:32",
  "issue": "2026169",
  "code": "44,37,30,8,40,22,24",
  "zodiac": "猪,马,牛,猪,兔,鸡,羊",
  "wave": "green,blue,red,red,red,green,red",
  "teSx": "羊",
  "teWei": "4",
  "nextIssue": "2026170",
  "ninePool": [
    "鸡",
    "猴",
    "兔",
    "蛇",
    "马",
    "猪",
    "虎",
    "龙",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "兔",
    "蛇",
    "马",
    "猪"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "兔",
    "蛇",
    "马",
    "猪",
    "虎",
    "龙",
    "狗"
  ],
  "numbers": [
    10,
    11,
    4,
    14,
    1,
    20,
    40,
    34,
    44,
    23,
    13,
    35
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34
    ],
    "猴": [
      11,
      23,
      35
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14
    ],
    "马": [
      1,
      13
    ],
    "猪": [
      20,
      44
    ]
  },
  "top7Tails": [
    0,
    4,
    1,
    3,
    5,
    6,
    7
  ],
  "dynamicRate9": 74.07407407407408,
  "dynamicRate6": 59.25925925925925
};