var oracleData = {
  "time": "2026-07-11 21:32:32",
  "issue": "2026192",
  "code": "27,30,45,8,1,37,25",
  "zodiac": "龙,牛,狗,猪,马,马,马",
  "wave": "green,red,red,red,red,blue,blue",
  "teSx": "马",
  "teWei": "5",
  "nextIssue": "2026193",
  "ninePool": [
    "狗",
    "鼠",
    "牛",
    "羊",
    "猴",
    "虎",
    "蛇",
    "鸡",
    "猪"
  ],
  "sixPool": [
    "狗",
    "鼠",
    "牛",
    "羊",
    "猴",
    "虎"
  ],
  "killZodiacs": [
    "狗",
    "马"
  ],
  "rangeZodiacs": [
    "狗",
    "鼠",
    "牛",
    "羊",
    "猴",
    "虎",
    "蛇",
    "鸡",
    "猪"
  ],
  "numbers": [
    9,
    7,
    18,
    12,
    47,
    17,
    30,
    42,
    48,
    33,
    43,
    23
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      33
    ],
    "鼠": [
      7,
      43
    ],
    "牛": [
      18,
      30,
      42
    ],
    "羊": [
      12,
      48
    ],
    "猴": [
      47,
      23
    ],
    "虎": [
      17
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    8,
    3,
    4,
    5
  ],
  "dynamicRate9": 82.0,
  "dynamicRate6": 66.0
};