var oracleData = {
  "time": "2026-08-10 21:32:32",
  "issue": "2026222",
  "code": "49,14,47,27,18,38,26",
  "zodiac": "马,蛇,猴,龙,牛,蛇,蛇",
  "wave": "green,blue,blue,green,red,green,blue",
  "teSx": "蛇",
  "teWei": "6",
  "nextIssue": "2026223",
  "ninePool": [
    "鸡",
    "狗",
    "猪",
    "牛",
    "虎",
    "兔",
    "羊",
    "猴",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "猪",
    "牛",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "猪",
    "牛",
    "虎",
    "兔",
    "羊",
    "猴",
    "龙"
  ],
  "numbers": [
    10,
    9,
    20,
    30,
    29,
    40,
    22,
    32,
    42,
    21,
    41,
    33
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "狗": [
      9,
      21,
      33
    ],
    "猪": [
      20,
      32
    ],
    "牛": [
      30,
      42
    ],
    "虎": [
      29,
      41
    ],
    "兔": [
      40
    ]
  },
  "top7Tails": [
    0,
    2,
    9,
    1,
    3,
    5,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 62.0
};