var oracleData = {
  "time": "2026-07-25 21:32:32",
  "issue": "2026206",
  "code": "9,49,37,3,40,35,47",
  "zodiac": "狗,马,马,龙,兔,猴,猴",
  "wave": "blue,green,blue,blue,red,red,blue",
  "teSx": "猴",
  "teWei": "7",
  "nextIssue": "2026207",
  "ninePool": [
    "牛",
    "鸡",
    "蛇",
    "狗",
    "马",
    "鼠",
    "猪",
    "兔",
    "羊"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "蛇",
    "狗",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "兔",
    "猴"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "蛇",
    "狗",
    "马",
    "鼠",
    "猪",
    "兔",
    "羊"
  ],
  "numbers": [
    6,
    34,
    14,
    21,
    1,
    31,
    30,
    10,
    42,
    22,
    2,
    33
  ],
  "zodiacNumMap": {
    "牛": [
      6,
      30,
      42
    ],
    "鸡": [
      34,
      10,
      22
    ],
    "蛇": [
      14,
      2
    ],
    "狗": [
      21,
      33
    ],
    "马": [
      1
    ],
    "鼠": [
      31
    ]
  },
  "top7Tails": [
    1,
    4,
    0,
    2,
    3,
    6,
    7
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 62.0
};