var oracleData = {
  "time": "2026-06-13 21:32:32",
  "issue": "2026164",
  "code": "46,4,38,12,3,2,21",
  "zodiac": "鸡,兔,蛇,羊,龙,蛇,狗",
  "wave": "red,blue,green,red,blue,red,green",
  "teSx": "狗",
  "teWei": "1",
  "nextIssue": "2026165",
  "ninePool": [
    "鸡",
    "猴",
    "龙",
    "马",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "龙",
    "马",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "龙",
    "马",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "numbers": [
    34,
    23,
    3,
    13,
    43,
    24,
    35,
    15,
    25,
    10,
    46,
    36
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      46
    ],
    "猴": [
      23,
      35
    ],
    "龙": [
      3,
      15
    ],
    "马": [
      13,
      25
    ],
    "鼠": [
      43
    ],
    "羊": [
      24,
      36
    ]
  },
  "top7Tails": [
    3,
    4,
    5,
    0,
    6,
    8,
    9
  ],
  "dynamicRate9": 68.18181818181817,
  "dynamicRate6": 54.54545454545454
};