var oracleData = {
  "time": "2026-08-19 21:32:32",
  "issue": "2026231",
  "code": "39,46,23,11,8,13,20",
  "zodiac": "龙,鸡,猴,猴,猪,马,猪",
  "wave": "green,red,red,green,red,red,blue",
  "teSx": "猪",
  "teWei": "0",
  "nextIssue": "2026232",
  "ninePool": [
    "鸡",
    "龙",
    "牛",
    "羊",
    "虎",
    "蛇",
    "鼠",
    "狗",
    "马"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "牛",
    "羊",
    "虎",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "牛",
    "羊",
    "虎",
    "蛇",
    "鼠",
    "狗",
    "马"
  ],
  "numbers": [
    10,
    15,
    30,
    12,
    5,
    2,
    22,
    42,
    34,
    24,
    14,
    27
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "龙": [
      15,
      27
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      12,
      24
    ],
    "虎": [
      5
    ],
    "蛇": [
      2,
      14
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    7,
    8,
    9
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 56.00000000000001
};