var oracleData = {
  "time": "2026-06-22 21:32:32",
  "issue": "2026173",
  "code": "39,6,16,40,13,19,26",
  "zodiac": "龙,牛,兔,兔,马,鼠,蛇",
  "wave": "green,green,green,red,red,red,blue",
  "teSx": "蛇",
  "teWei": "6",
  "nextIssue": "2026174",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "猪",
    "牛",
    "马",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "猪",
    "牛"
  ],
  "killZodiacs": [
    "狗",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "虎",
    "羊",
    "猪",
    "牛",
    "马",
    "狗",
    "鼠"
  ],
  "numbers": [
    10,
    11,
    5,
    12,
    20,
    30,
    22,
    32,
    42,
    41,
    35,
    46
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      46
    ],
    "猴": [
      11,
      35
    ],
    "虎": [
      5,
      41
    ],
    "羊": [
      12
    ],
    "猪": [
      20,
      32
    ],
    "牛": [
      30,
      42
    ]
  },
  "top7Tails": [
    0,
    2,
    1,
    5,
    6,
    7,
    8
  ],
  "dynamicRate9": 77.41935483870968,
  "dynamicRate6": 58.06451612903226
};