var oracleData = {
  "time": "2026-07-04 21:32:32",
  "issue": "2026185",
  "code": "18,35,9,41,12,30,36",
  "zodiac": "牛,猴,狗,虎,羊,牛,羊",
  "wave": "red,red,blue,blue,red,red,blue",
  "teSx": "羊",
  "teWei": "6",
  "nextIssue": "2026186",
  "ninePool": [
    "猴",
    "猪",
    "兔",
    "蛇",
    "鸡",
    "鼠",
    "牛",
    "狗",
    "虎"
  ],
  "sixPool": [
    "猴",
    "猪",
    "兔",
    "蛇",
    "鸡",
    "鼠"
  ],
  "killZodiacs": [
    "蛇",
    "羊"
  ],
  "rangeZodiacs": [
    "猴",
    "猪",
    "兔",
    "蛇",
    "鸡",
    "鼠",
    "牛",
    "狗",
    "虎"
  ],
  "numbers": [
    23,
    32,
    16,
    2,
    22,
    7,
    43,
    47,
    20,
    40,
    10,
    35
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      47,
      35
    ],
    "猪": [
      32,
      20
    ],
    "兔": [
      16,
      40
    ],
    "蛇": [
      2
    ],
    "鸡": [
      22,
      10
    ],
    "鼠": [
      7,
      43
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    0,
    5,
    6,
    8
  ],
  "dynamicRate9": 81.3953488372093,
  "dynamicRate6": 65.11627906976744
};