var oracleData = {
  "time": "2026-08-22 21:32:32",
  "issue": "2026234",
  "code": "25,30,37,19,7,17,39",
  "zodiac": "马,牛,马,鼠,鼠,虎,龙",
  "wave": "blue,red,blue,red,red,green,green",
  "teSx": "龙",
  "teWei": "9",
  "nextIssue": "2026235",
  "ninePool": [
    "鸡",
    "虎",
    "兔",
    "狗",
    "马",
    "猴",
    "羊",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "虎",
    "兔",
    "狗",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "狗",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "虎",
    "兔",
    "狗",
    "马",
    "猴",
    "羊",
    "牛",
    "蛇"
  ],
  "numbers": [
    34,
    5,
    4,
    45,
    25,
    35,
    10,
    40,
    41,
    21,
    1,
    11
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "虎": [
      5,
      41
    ],
    "兔": [
      4,
      40
    ],
    "狗": [
      45,
      21
    ],
    "马": [
      25,
      1
    ],
    "猴": [
      35,
      11
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    2,
    3,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 56.00000000000001
};