var oracleData = {
  "time": "2026-10-11 21:32:32",
  "issue": "2026284",
  "code": "4,35,22,48,3,18,32",
  "zodiac": "兔,猴,鸡,羊,龙,牛,猪",
  "wave": "blue,red,green,blue,blue,red,green",
  "teSx": "猪",
  "teWei": "2",
  "nextIssue": "2026285",
  "ninePool": [
    "羊",
    "兔",
    "蛇",
    "鸡",
    "虎",
    "马",
    "鼠",
    "龙",
    "狗"
  ],
  "sixPool": [
    "羊",
    "兔",
    "蛇",
    "鸡",
    "虎",
    "马"
  ],
  "killZodiacs": [
    "蛇",
    "猪"
  ],
  "rangeZodiacs": [
    "羊",
    "兔",
    "蛇",
    "鸡",
    "虎",
    "马",
    "鼠",
    "龙",
    "狗"
  ],
  "numbers": [
    36,
    16,
    26,
    46,
    29,
    1,
    41,
    12,
    2,
    22,
    24,
    4
  ],
  "zodiacNumMap": {
    "羊": [
      36,
      12,
      24
    ],
    "兔": [
      16,
      4
    ],
    "蛇": [
      26,
      2
    ],
    "鸡": [
      46,
      22
    ],
    "虎": [
      29,
      41
    ],
    "马": [
      1
    ]
  },
  "top7Tails": [
    6,
    9,
    1,
    2,
    4,
    5,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 54.0
};