var oracleData = {
  "time": "2026-06-05 21:32:32",
  "issue": "2026156",
  "code": "31,16,11,3,37,12,1",
  "zodiac": "鼠,兔,猴,龙,马,羊,马",
  "wave": "blue,green,green,blue,blue,red,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026157",
  "ninePool": [
    "鸡",
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛",
    "虎",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛",
    "虎",
    "蛇",
    "猪"
  ],
  "numbers": [
    10,
    23,
    24,
    9,
    19,
    6,
    30,
    34,
    46,
    36,
    22,
    12
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46,
      22
    ],
    "猴": [
      23
    ],
    "羊": [
      24,
      36,
      12
    ],
    "狗": [
      9
    ],
    "鼠": [
      19
    ],
    "牛": [
      6,
      30
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    3,
    5,
    8
  ],
  "dynamicRate9": 78.57142857142857,
  "dynamicRate6": 64.28571428571429
};