var oracleData = {
  "time": "2026-06-11 21:32:32",
  "issue": "2026162",
  "code": "23,41,24,26,33,7,32",
  "zodiac": "猴,虎,羊,蛇,狗,鼠,猪",
  "wave": "red,blue,red,blue,green,red,green",
  "teSx": "猪",
  "teWei": "2",
  "nextIssue": "2026163",
  "ninePool": [
    "鸡",
    "牛",
    "虎",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "马"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "虎",
    "兔",
    "蛇",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "虎",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "马"
  ],
  "numbers": [
    34,
    6,
    5,
    4,
    14,
    33,
    10,
    30,
    40,
    22,
    42,
    2
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      22
    ],
    "牛": [
      6,
      30,
      42
    ],
    "虎": [
      5
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14,
      2
    ],
    "狗": [
      33
    ]
  },
  "top7Tails": [
    3,
    4,
    0,
    2,
    5,
    6,
    7
  ],
  "dynamicRate9": 70.0,
  "dynamicRate6": 60.0
};