var oracleData = {
  "time": "2026-09-08 21:32:32",
  "issue": "2026251",
  "code": "9,6,11,25,8,45,30",
  "zodiac": "狗,牛,猴,马,猪,狗,牛",
  "wave": "blue,green,green,blue,red,red,red",
  "teSx": "牛",
  "teWei": "0",
  "nextIssue": "2026252",
  "ninePool": [
    "鼠",
    "羊",
    "猪",
    "兔",
    "蛇",
    "马",
    "虎",
    "龙",
    "狗"
  ],
  "sixPool": [
    "鼠",
    "羊",
    "猪",
    "兔",
    "蛇",
    "马"
  ],
  "killZodiacs": [
    "狗",
    "牛"
  ],
  "rangeZodiacs": [
    "鼠",
    "羊",
    "猪",
    "兔",
    "蛇",
    "马",
    "虎",
    "龙",
    "狗"
  ],
  "numbers": [
    7,
    12,
    32,
    4,
    2,
    25,
    37,
    31,
    1,
    43,
    13,
    24
  ],
  "zodiacNumMap": {
    "鼠": [
      7,
      31,
      43
    ],
    "羊": [
      12,
      24
    ],
    "猪": [
      32
    ],
    "兔": [
      4
    ],
    "蛇": [
      2
    ],
    "马": [
      25,
      37,
      1,
      13
    ]
  },
  "top7Tails": [
    2,
    5,
    7,
    1,
    3,
    4,
    6
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 54.0
};