var oracleData = {
  "time": "2026-05-27 21:32:32",
  "issue": "2026147",
  "code": "29,40,6,18,31,10,13",
  "zodiac": "虎,兔,牛,牛,鼠,鸡,马",
  "wave": "red,red,green,red,blue,blue,red",
  "teSx": "马",
  "teWei": "3",
  "nextIssue": "2026148",
  "ninePool": [
    "龙",
    "鸡",
    "鼠",
    "虎",
    "狗",
    "羊",
    "猴",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "鼠",
    "虎",
    "狗",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "鼠",
    "虎",
    "狗",
    "羊",
    "猴",
    "兔",
    "蛇"
  ],
  "numbers": [
    27,
    10,
    7,
    17,
    21,
    48,
    31,
    41,
    22,
    12,
    15,
    5
  ],
  "zodiacNumMap": {
    "龙": [
      27,
      15
    ],
    "鸡": [
      10,
      22
    ],
    "鼠": [
      7,
      31
    ],
    "虎": [
      17,
      41,
      5
    ],
    "狗": [
      21
    ],
    "羊": [
      48,
      12
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    8,
    2,
    5,
    9
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 40.0
};