var oracleData = {
  "time": "2026-09-09 21:32:32",
  "issue": "2026252",
  "code": "33,41,43,13,6,48,22",
  "zodiac": "狗,虎,鼠,马,牛,羊,鸡",
  "wave": "green,blue,green,red,green,blue,green",
  "teSx": "鸡",
  "teWei": "2",
  "nextIssue": "2026253",
  "ninePool": [
    "龙",
    "羊",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "虎",
    "马",
    "猴"
  ],
  "sixPool": [
    "龙",
    "羊",
    "兔",
    "蛇",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "猪",
    "鸡"
  ],
  "rangeZodiacs": [
    "龙",
    "羊",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "虎",
    "马",
    "猴"
  ],
  "numbers": [
    15,
    12,
    4,
    2,
    45,
    7,
    27,
    21,
    31,
    3,
    33,
    43
  ],
  "zodiacNumMap": {
    "龙": [
      15,
      27,
      3
    ],
    "羊": [
      12
    ],
    "兔": [
      4
    ],
    "蛇": [
      2
    ],
    "狗": [
      45,
      21,
      33
    ],
    "鼠": [
      7,
      31,
      43
    ]
  },
  "top7Tails": [
    2,
    5,
    7,
    1,
    3,
    4,
    6
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 56.00000000000001
};