var oracleData = {
  "time": "2026-08-16 21:32:32",
  "issue": "2026228",
  "code": "38,26,8,6,29,18,23",
  "zodiac": "蛇,蛇,猪,牛,虎,牛,猴",
  "wave": "green,blue,red,green,red,red,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026229",
  "ninePool": [
    "鸡",
    "龙",
    "猪",
    "虎",
    "蛇",
    "马",
    "狗",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "猪",
    "虎",
    "蛇",
    "马"
  ],
  "killZodiacs": [
    "虎",
    "猴"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "猪",
    "虎",
    "蛇",
    "马",
    "狗",
    "牛",
    "羊"
  ],
  "numbers": [
    10,
    15,
    20,
    5,
    2,
    25,
    22,
    32,
    34,
    44,
    14,
    8
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "龙": [
      15
    ],
    "猪": [
      20,
      32,
      44,
      8
    ],
    "虎": [
      5
    ],
    "蛇": [
      2,
      14
    ],
    "马": [
      25
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    8,
    9,
    1
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 57.99999999999999
};