var oracleData = {
  "time": "2026-07-06 21:32:32",
  "issue": "2026187",
  "code": "23,12,36,38,27,22,1",
  "zodiac": "猴,羊,羊,蛇,龙,鸡,马",
  "wave": "red,red,blue,green,green,green,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026188",
  "ninePool": [
    "龙",
    "羊",
    "猴",
    "狗",
    "鼠",
    "兔",
    "鸡",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "龙",
    "羊",
    "猴",
    "狗",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "rangeZodiacs": [
    "龙",
    "羊",
    "猴",
    "狗",
    "鼠",
    "兔",
    "鸡",
    "猪",
    "蛇"
  ],
  "numbers": [
    27,
    12,
    47,
    9,
    7,
    40,
    3,
    23,
    33,
    43,
    15,
    35
  ],
  "zodiacNumMap": {
    "龙": [
      27,
      3,
      15
    ],
    "羊": [
      12
    ],
    "猴": [
      47,
      23,
      35
    ],
    "狗": [
      9,
      33
    ],
    "鼠": [
      7,
      43
    ],
    "兔": [
      40
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    3,
    5,
    6,
    8
  ],
  "dynamicRate9": 82.6086956521739,
  "dynamicRate6": 67.3913043478261
};