var oracleData = {
  "time": "2026-05-24 21:32:32",
  "issue": "2026144",
  "code": "47,31,29,33,22,26,43",
  "zodiac": "猴,鼠,虎,狗,鸡,蛇,鼠",
  "wave": "blue,blue,red,green,green,blue,green",
  "teSx": "鼠",
  "teWei": "3",
  "nextIssue": "2026145",
  "ninePool": [
    "鸡",
    "虎",
    "龙",
    "狗",
    "马",
    "牛",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "虎",
    "龙",
    "狗",
    "马",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "虎",
    "龙",
    "狗",
    "马",
    "牛",
    "猪",
    "兔",
    "蛇"
  ],
  "numbers": [
    22,
    5,
    15,
    21,
    1,
    42,
    41,
    45,
    25,
    10,
    30,
    17
  ],
  "zodiacNumMap": {
    "鸡": [
      22,
      10
    ],
    "虎": [
      5,
      41,
      17
    ],
    "龙": [
      15
    ],
    "狗": [
      21,
      45
    ],
    "马": [
      1,
      25
    ],
    "牛": [
      42,
      30
    ]
  },
  "top7Tails": [
    1,
    2,
    5,
    0,
    7,
    8,
    9
  ],
  "dynamicRate9": 66.66666666666666,
  "dynamicRate6": 33.33333333333333
};