var oracleData = {
  "time": "2026-08-09 21:32:32",
  "issue": "2026221",
  "code": "24,14,18,48,46,28,1",
  "zodiac": "羊,蛇,牛,羊,鸡,兔,马",
  "wave": "red,blue,red,blue,red,green,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026222",
  "ninePool": [
    "狗",
    "鸡",
    "龙",
    "牛",
    "虎",
    "猴",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "龙",
    "牛",
    "虎",
    "猴"
  ],
  "killZodiacs": [
    "虎",
    "马"
  ],
  "rangeZodiacs": [
    "狗",
    "鸡",
    "龙",
    "牛",
    "虎",
    "猴",
    "猪",
    "兔",
    "蛇"
  ],
  "numbers": [
    9,
    10,
    39,
    30,
    29,
    11,
    22,
    42,
    21,
    41,
    33,
    3
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21,
      33
    ],
    "鸡": [
      10,
      22
    ],
    "龙": [
      39,
      3
    ],
    "牛": [
      30,
      42
    ],
    "虎": [
      29,
      41
    ],
    "猴": [
      11
    ]
  },
  "top7Tails": [
    0,
    2,
    9,
    1,
    3,
    5,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 60.0
};