var oracleData = {
  "time": "2026-08-14 21:32:32",
  "issue": "2026226",
  "code": "1,11,29,38,4,33,17",
  "zodiac": "马,猴,虎,蛇,兔,狗,虎",
  "wave": "red,green,red,green,blue,green,green",
  "teSx": "虎",
  "teWei": "7",
  "nextIssue": "2026227",
  "ninePool": [
    "龙",
    "鸡",
    "猪",
    "蛇",
    "马",
    "猴",
    "狗",
    "兔",
    "羊"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "猪",
    "蛇",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "蛇",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "猪",
    "蛇",
    "马",
    "猴",
    "狗",
    "兔",
    "羊"
  ],
  "numbers": [
    15,
    10,
    20,
    2,
    25,
    35,
    22,
    32,
    34,
    44,
    14,
    8
  ],
  "zodiacNumMap": {
    "龙": [
      15
    ],
    "鸡": [
      10,
      22,
      34
    ],
    "猪": [
      20,
      32,
      44,
      8
    ],
    "蛇": [
      2,
      14
    ],
    "马": [
      25
    ],
    "猴": [
      35
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    8,
    9,
    1
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 57.99999999999999
};