var oracleData = {
  "time": "2026-07-15 21:32:32",
  "issue": "2026196",
  "code": "3,37,24,10,41,19,39",
  "zodiac": "龙,马,羊,鸡,虎,鼠,龙",
  "wave": "blue,blue,red,blue,blue,red,green",
  "teSx": "龙",
  "teWei": "9",
  "nextIssue": "2026197",
  "ninePool": [
    "猪",
    "鸡",
    "虎",
    "兔",
    "猴",
    "狗",
    "牛",
    "羊",
    "蛇"
  ],
  "sixPool": [
    "猪",
    "鸡",
    "虎",
    "兔",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "兔",
    "龙"
  ],
  "rangeZodiacs": [
    "猪",
    "鸡",
    "虎",
    "兔",
    "猴",
    "狗",
    "牛",
    "羊",
    "蛇"
  ],
  "numbers": [
    8,
    10,
    17,
    4,
    47,
    21,
    20,
    40,
    32,
    22,
    44,
    34
  ],
  "zodiacNumMap": {
    "猪": [
      8,
      20,
      32,
      44
    ],
    "鸡": [
      10,
      22,
      34
    ],
    "虎": [
      17
    ],
    "兔": [
      4,
      40
    ],
    "猴": [
      47
    ],
    "狗": [
      21
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    7,
    8,
    1,
    3
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 66.0
};