var oracleData = {
  "time": "2026-09-04 21:32:32",
  "issue": "2026247",
  "code": "3,9,43,29,46,4,40",
  "zodiac": "龙,狗,鼠,虎,鸡,兔,兔",
  "wave": "blue,blue,green,red,red,blue,red",
  "teSx": "兔",
  "teWei": "0",
  "nextIssue": "2026248",
  "ninePool": [
    "猪",
    "蛇",
    "狗",
    "牛",
    "龙",
    "鼠",
    "猴",
    "虎",
    "马"
  ],
  "sixPool": [
    "猪",
    "蛇",
    "狗",
    "牛",
    "龙",
    "鼠"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "rangeZodiacs": [
    "猪",
    "蛇",
    "狗",
    "牛",
    "龙",
    "鼠",
    "猴",
    "虎",
    "马"
  ],
  "numbers": [
    44,
    14,
    33,
    6,
    3,
    43,
    20,
    30,
    21,
    31,
    32,
    2
  ],
  "zodiacNumMap": {
    "猪": [
      44,
      20,
      32
    ],
    "蛇": [
      14,
      2
    ],
    "狗": [
      33,
      21
    ],
    "牛": [
      6,
      30
    ],
    "龙": [
      3
    ],
    "鼠": [
      43,
      31
    ]
  },
  "top7Tails": [
    3,
    4,
    0,
    1,
    2,
    5,
    6
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 52.0
};