var oracleData = {
  "time": "2026-07-21 21:32:32",
  "issue": "2026202",
  "code": "21,15,25,47,13,45,40",
  "zodiac": "狗,龙,马,猴,马,狗,兔",
  "wave": "green,blue,blue,blue,red,red,red",
  "teSx": "兔",
  "teWei": "0",
  "nextIssue": "2026203",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "狗",
    "猪",
    "猴",
    "虎",
    "马",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "狗",
    "猪",
    "猴"
  ],
  "killZodiacs": [
    "牛",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "羊",
    "狗",
    "猪",
    "猴",
    "虎",
    "马",
    "鼠"
  ],
  "numbers": [
    10,
    30,
    24,
    21,
    20,
    11,
    33,
    23,
    34,
    44,
    22,
    42
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      22
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      24
    ],
    "狗": [
      21,
      33
    ],
    "猪": [
      20,
      44
    ],
    "猴": [
      11,
      23
    ]
  },
  "top7Tails": [
    0,
    1,
    3,
    4,
    2,
    7,
    8
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 62.0
};