var oracleData = {
  "time": "2026-07-07 21:32:32",
  "issue": "2026188",
  "code": "38,5,19,10,14,1,16",
  "zodiac": "蛇,虎,鼠,鸡,蛇,马,兔",
  "wave": "green,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026189",
  "ninePool": [
    "蛇",
    "鸡",
    "猪",
    "龙",
    "羊",
    "狗",
    "牛",
    "猴",
    "鼠"
  ],
  "sixPool": [
    "蛇",
    "鸡",
    "猪",
    "龙",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "兔"
  ],
  "rangeZodiacs": [
    "蛇",
    "鸡",
    "猪",
    "龙",
    "羊",
    "狗",
    "牛",
    "猴",
    "鼠"
  ],
  "numbers": [
    2,
    10,
    20,
    27,
    12,
    9,
    22,
    32,
    3,
    33,
    14,
    34
  ],
  "zodiacNumMap": {
    "蛇": [
      2,
      14
    ],
    "鸡": [
      10,
      22,
      34
    ],
    "猪": [
      20,
      32
    ],
    "龙": [
      27,
      3
    ],
    "羊": [
      12
    ],
    "狗": [
      9,
      33
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    3,
    4,
    5,
    6
  ],
  "dynamicRate9": 82.6086956521739,
  "dynamicRate6": 67.3913043478261
};