var oracleData = {
  "time": "2026-07-10 21:32:32",
  "issue": "2026191",
  "code": "19,43,39,24,16,26,29",
  "zodiac": "鼠,鼠,龙,羊,兔,蛇,虎",
  "wave": "red,green,green,red,green,blue,red",
  "teSx": "虎",
  "teWei": "9",
  "nextIssue": "2026192",
  "ninePool": [
    "蛇",
    "狗",
    "猪",
    "龙",
    "马",
    "猴",
    "鸡",
    "兔",
    "羊"
  ],
  "sixPool": [
    "蛇",
    "狗",
    "猪",
    "龙",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "rangeZodiacs": [
    "蛇",
    "狗",
    "猪",
    "龙",
    "马",
    "猴",
    "鸡",
    "兔",
    "羊"
  ],
  "numbers": [
    2,
    9,
    8,
    27,
    37,
    47,
    20,
    32,
    38,
    33,
    3,
    13
  ],
  "zodiacNumMap": {
    "蛇": [
      2,
      38
    ],
    "狗": [
      9,
      33
    ],
    "猪": [
      8,
      20,
      32
    ],
    "龙": [
      27,
      3
    ],
    "马": [
      37,
      13
    ],
    "猴": [
      47
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    8,
    3,
    4,
    5
  ],
  "dynamicRate9": 81.63265306122449,
  "dynamicRate6": 67.3469387755102
};