var oracleData = {
  "time": "2026-06-24 21:32:32",
  "issue": "2026175",
  "code": "7,19,30,29,28,25,26",
  "zodiac": "鼠,鼠,牛,虎,兔,马,蛇",
  "wave": "red,red,red,red,green,blue,blue",
  "teSx": "蛇",
  "teWei": "6",
  "nextIssue": "2026176",
  "ninePool": [
    "鸡",
    "猴",
    "兔",
    "牛",
    "羊",
    "猪",
    "马",
    "狗",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "兔",
    "牛",
    "羊",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "兔",
    "牛",
    "羊",
    "猪",
    "马",
    "狗",
    "龙"
  ],
  "numbers": [
    10,
    47,
    40,
    30,
    12,
    20,
    22,
    42,
    32,
    11,
    35,
    28
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "猴": [
      47,
      11,
      35
    ],
    "兔": [
      40,
      28
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      12
    ],
    "猪": [
      20,
      32
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    1,
    5,
    8,
    9
  ],
  "dynamicRate9": 78.78787878787878,
  "dynamicRate6": 60.60606060606061
};