var oracleData = {
  "time": "2026-10-05 21:32:32",
  "issue": "2026278",
  "code": "6,40,24,29,44,1,2",
  "zodiac": "牛,兔,羊,虎,猪,马,蛇",
  "wave": "green,red,red,red,green,red,red",
  "teSx": "蛇",
  "teWei": "2",
  "nextIssue": "2026279",
  "ninePool": [
    "龙",
    "牛",
    "羊",
    "猪",
    "虎",
    "兔",
    "鸡",
    "马",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "牛",
    "羊",
    "猪",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "鼠",
    "蛇"
  ],
  "rangeZodiacs": [
    "龙",
    "牛",
    "羊",
    "猪",
    "虎",
    "兔",
    "鸡",
    "马",
    "鼠"
  ],
  "numbers": [
    3,
    6,
    36,
    8,
    17,
    16,
    18,
    48,
    28,
    30,
    20,
    40
  ],
  "zodiacNumMap": {
    "龙": [
      3
    ],
    "牛": [
      6,
      18,
      30
    ],
    "羊": [
      36,
      48
    ],
    "猪": [
      8,
      20
    ],
    "虎": [
      17
    ],
    "兔": [
      16,
      28,
      40
    ]
  },
  "top7Tails": [
    6,
    8,
    0,
    1,
    3,
    4,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999
};