var oracleData = {
  "time": "2026-06-20 21:32:32",
  "issue": "2026171",
  "code": "24,38,40,31,42,46,28",
  "zodiac": "羊,蛇,兔,鼠,牛,鸡,兔",
  "wave": "red,green,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": "8",
  "nextIssue": "2026172",
  "ninePool": [
    "鸡",
    "猴",
    "蛇",
    "猪",
    "龙",
    "羊",
    "狗",
    "虎",
    "马"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "蛇",
    "猪",
    "龙",
    "羊"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "蛇",
    "猪",
    "龙",
    "羊",
    "狗",
    "虎",
    "马"
  ],
  "numbers": [
    10,
    11,
    2,
    20,
    15,
    12,
    22,
    32,
    34,
    14,
    44,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "猴": [
      11
    ],
    "蛇": [
      2,
      14
    ],
    "猪": [
      20,
      32,
      44
    ],
    "龙": [
      15
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    4,
    5,
    6,
    7
  ],
  "dynamicRate9": 75.86206896551724,
  "dynamicRate6": 55.172413793103445
};