var oracleData = {
  "time": "2026-08-28 21:32:32",
  "issue": "2026240",
  "code": "2,34,22,26,28,37,27",
  "zodiac": "蛇,鸡,鸡,蛇,兔,马,龙",
  "wave": "red,red,green,blue,green,blue,green",
  "teSx": "龙",
  "teWei": "7",
  "nextIssue": "2026241",
  "ninePool": [
    "鸡",
    "马",
    "狗",
    "兔",
    "猴",
    "蛇",
    "牛",
    "羊",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "马",
    "狗",
    "兔",
    "猴",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "马",
    "狗",
    "兔",
    "猴",
    "蛇",
    "牛",
    "羊",
    "猪"
  ],
  "numbers": [
    34,
    13,
    33,
    4,
    23,
    14,
    28,
    38,
    10,
    40,
    1,
    21
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "马": [
      13,
      1
    ],
    "狗": [
      33,
      21
    ],
    "兔": [
      4,
      28,
      40
    ],
    "猴": [
      23
    ],
    "蛇": [
      14,
      38
    ]
  },
  "top7Tails": [
    3,
    4,
    8,
    0,
    1,
    5,
    6
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 48.0
};