var oracleData = {
  "time": "2026-08-20 21:32:32",
  "issue": "2026232",
  "code": "29,10,17,4,46,20,42",
  "zodiac": "虎,鸡,虎,兔,鸡,猪,牛",
  "wave": "red,blue,green,blue,red,blue,blue",
  "teSx": "牛",
  "teWei": "2",
  "nextIssue": "2026233",
  "ninePool": [
    "鸡",
    "龙",
    "鼠",
    "羊",
    "兔",
    "蛇",
    "马",
    "狗",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "鼠",
    "羊",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "鼠",
    "羊",
    "兔",
    "蛇",
    "马",
    "狗",
    "虎"
  ],
  "numbers": [
    22,
    15,
    7,
    12,
    4,
    2,
    34,
    24,
    14,
    10,
    40,
    31
  ],
  "zodiacNumMap": {
    "鸡": [
      22,
      34,
      10
    ],
    "龙": [
      15
    ],
    "鼠": [
      7,
      31
    ],
    "羊": [
      12,
      24
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      2,
      14
    ]
  },
  "top7Tails": [
    2,
    4,
    5,
    0,
    1,
    7,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 56.00000000000001
};