var oracleData = {
  "time": "2026-10-08 21:32:32",
  "issue": "2026281",
  "code": "22,19,21,32,48,38,10",
  "zodiac": "鸡,鼠,狗,猪,羊,蛇,鸡",
  "wave": "green,red,green,green,blue,green,blue",
  "teSx": "鸡",
  "teWei": "0",
  "nextIssue": "2026282",
  "ninePool": [
    "猪",
    "牛",
    "兔",
    "羊",
    "狗",
    "马",
    "鼠",
    "猴",
    "虎"
  ],
  "sixPool": [
    "猪",
    "牛",
    "兔",
    "羊",
    "狗",
    "马"
  ],
  "killZodiacs": [
    "鸡",
    "鸡"
  ],
  "rangeZodiacs": [
    "猪",
    "牛",
    "兔",
    "羊",
    "狗",
    "马",
    "鼠",
    "猴",
    "虎"
  ],
  "numbers": [
    8,
    6,
    16,
    36,
    9,
    1,
    18,
    28,
    48,
    20,
    30,
    40
  ],
  "zodiacNumMap": {
    "猪": [
      8,
      20
    ],
    "牛": [
      6,
      18,
      30
    ],
    "兔": [
      16,
      28,
      40
    ],
    "羊": [
      36,
      48
    ],
    "狗": [
      9
    ],
    "马": [
      1
    ]
  },
  "top7Tails": [
    6,
    8,
    9,
    0,
    1,
    3,
    4
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999
};