var oracleData = {
  "time": "2026-10-30 21:32:32",
  "issue": "2026303",
  "code": "8,28,40,3,38,49,17",
  "zodiac": "猪,兔,兔,龙,蛇,马,虎",
  "wave": "red,green,red,blue,green,green,green",
  "teSx": "虎",
  "teWei": "7",
  "nextIssue": "2026304",
  "ninePool": [
    "龙",
    "鸡",
    "鼠",
    "蛇",
    "马",
    "猴",
    "猪",
    "羊",
    "牛"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "鼠",
    "蛇",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "鼠",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "鼠",
    "蛇",
    "马",
    "猴",
    "猪",
    "羊",
    "牛"
  ],
  "numbers": [
    39,
    10,
    19,
    2,
    1,
    11,
    31,
    22,
    34,
    14,
    46,
    26
  ],
  "zodiacNumMap": {
    "龙": [
      39
    ],
    "鸡": [
      10,
      22,
      34,
      46
    ],
    "鼠": [
      19,
      31
    ],
    "蛇": [
      2,
      14,
      26
    ],
    "马": [
      1
    ],
    "猴": [
      11
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    4,
    6,
    9,
    7
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 50.0
};