var oracleData = {
  "time": "2026-10-24 21:32:32",
  "issue": "2026297",
  "code": "27,40,25,26,33,9,13",
  "zodiac": "龙,兔,马,蛇,狗,狗,马",
  "wave": "green,red,blue,blue,green,blue,red",
  "teSx": "马",
  "teWei": "3",
  "nextIssue": "2026298",
  "ninePool": [
    "狗",
    "鼠",
    "牛",
    "龙",
    "虎",
    "鸡",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "狗",
    "鼠",
    "牛",
    "龙",
    "虎",
    "鸡"
  ],
  "killZodiacs": [
    "鼠",
    "马"
  ],
  "rangeZodiacs": [
    "狗",
    "鼠",
    "牛",
    "龙",
    "虎",
    "鸡",
    "猪",
    "兔",
    "蛇"
  ],
  "numbers": [
    9,
    19,
    42,
    39,
    29,
    22,
    21,
    31,
    41,
    34,
    30,
    10
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21
    ],
    "鼠": [
      19,
      31
    ],
    "牛": [
      42,
      30
    ],
    "龙": [
      39
    ],
    "虎": [
      29,
      41
    ],
    "鸡": [
      22,
      34,
      10
    ]
  },
  "top7Tails": [
    1,
    2,
    4,
    9,
    0,
    3,
    6
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 52.0
};