var oracleData = {
  "time": "2026-07-16 21:32:32",
  "issue": "2026197",
  "code": "40,19,30,48,44,28,8",
  "zodiac": "兔,鼠,牛,羊,猪,兔,猪",
  "wave": "red,red,red,blue,green,green,red",
  "teSx": "猪",
  "teWei": "8",
  "nextIssue": "2026198",
  "ninePool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔",
    "蛇",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "鸡",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "羊",
    "猴",
    "虎",
    "兔",
    "蛇",
    "鼠",
    "马"
  ],
  "numbers": [
    10,
    18,
    12,
    23,
    17,
    4,
    30,
    40,
    22,
    42,
    34,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "牛": [
      18,
      30,
      42
    ],
    "羊": [
      12,
      24
    ],
    "猴": [
      23
    ],
    "虎": [
      17
    ],
    "兔": [
      4,
      40
    ]
  },
  "top7Tails": [
    0,
    2,
    3,
    4,
    7,
    8,
    1
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 68.0
};