var oracleData = {
  "time": "2026-08-21 21:32:32",
  "issue": "2026233",
  "code": "18,41,5,49,4,34,7",
  "zodiac": "牛,虎,虎,马,兔,鸡,鼠",
  "wave": "red,blue,green,green,blue,red,red",
  "teSx": "鼠",
  "teWei": "7",
  "nextIssue": "2026234",
  "ninePool": [
    "鸡",
    "龙",
    "羊",
    "马",
    "猴",
    "狗",
    "兔",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "羊",
    "马",
    "猴",
    "狗"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "羊",
    "马",
    "猴",
    "狗",
    "兔",
    "蛇",
    "猪"
  ],
  "numbers": [
    34,
    15,
    24,
    25,
    35,
    45,
    10,
    1,
    11,
    21,
    22,
    12
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      22
    ],
    "龙": [
      15
    ],
    "羊": [
      24,
      12
    ],
    "马": [
      25,
      1
    ],
    "猴": [
      35,
      11
    ],
    "狗": [
      45,
      21
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    1,
    2,
    7,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 56.00000000000001
};