var oracleData = {
  "time": "2026-10-06 21:32:32",
  "issue": "2026279",
  "code": "29,32,47,38,6,26,10",
  "zodiac": "虎,猪,猴,蛇,牛,蛇,鸡",
  "wave": "red,green,blue,green,green,blue,blue",
  "teSx": "鸡",
  "teWei": "0",
  "nextIssue": "2026280",
  "ninePool": [
    "龙",
    "牛",
    "兔",
    "羊",
    "猪",
    "蛇",
    "马",
    "虎",
    "猴"
  ],
  "sixPool": [
    "龙",
    "牛",
    "兔",
    "羊",
    "猪",
    "蛇"
  ],
  "killZodiacs": [
    "猴",
    "鸡"
  ],
  "rangeZodiacs": [
    "龙",
    "牛",
    "兔",
    "羊",
    "猪",
    "蛇",
    "马",
    "虎",
    "猴"
  ],
  "numbers": [
    3,
    6,
    16,
    36,
    8,
    26,
    30,
    40,
    20,
    18,
    28,
    48
  ],
  "zodiacNumMap": {
    "龙": [
      3
    ],
    "牛": [
      6,
      30,
      18
    ],
    "兔": [
      16,
      40,
      28
    ],
    "羊": [
      36,
      48
    ],
    "猪": [
      8,
      20
    ],
    "蛇": [
      26
    ]
  },
  "top7Tails": [
    0,
    6,
    8,
    1,
    3,
    4,
    7
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 57.99999999999999
};