var oracleData = {
  "time": "2026-05-31 21:32:32",
  "issue": "2026151",
  "code": "27,15,29,42,20,41,31",
  "zodiac": "龙,龙,虎,牛,猪,虎,鼠",
  "wave": "green,blue,red,blue,blue,blue,blue",
  "teSx": "鼠",
  "teWei": "1",
  "nextIssue": "2026152",
  "ninePool": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "马",
    "羊",
    "兔",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "马",
    "羊"
  ],
  "killZodiacs": [
    "牛",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "马",
    "羊",
    "兔",
    "蛇",
    "猪"
  ],
  "numbers": [
    10,
    11,
    6,
    41,
    1,
    36,
    30,
    46,
    22,
    42,
    12,
    34
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      46,
      22,
      34
    ],
    "猴": [
      11
    ],
    "牛": [
      6,
      30,
      42
    ],
    "虎": [
      41
    ],
    "马": [
      1
    ],
    "羊": [
      36,
      12
    ]
  },
  "top7Tails": [
    0,
    1,
    6,
    2,
    4,
    5,
    7
  ],
  "dynamicRate9": 88.88888888888889,
  "dynamicRate6": 66.66666666666666
};