var oracleData = {
  "time": "2026-10-04 21:32:32",
  "issue": "2026277",
  "code": "41,23,14,31,13,32,11",
  "zodiac": "虎,猴,蛇,鼠,马,猪,猴",
  "wave": "blue,red,blue,blue,red,green,green",
  "teSx": "猴",
  "teWei": "1",
  "nextIssue": "2026278",
  "ninePool": [
    "龙",
    "马",
    "猪",
    "狗",
    "鼠",
    "羊",
    "牛",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "马",
    "猪",
    "狗",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "rangeZodiacs": [
    "龙",
    "马",
    "猪",
    "狗",
    "鼠",
    "羊",
    "牛",
    "兔",
    "鸡"
  ],
  "numbers": [
    3,
    1,
    8,
    21,
    31,
    36,
    48,
    13,
    33,
    43,
    44,
    24
  ],
  "zodiacNumMap": {
    "龙": [
      3
    ],
    "马": [
      1,
      13
    ],
    "猪": [
      8,
      44
    ],
    "狗": [
      21,
      33
    ],
    "鼠": [
      31,
      43
    ],
    "羊": [
      36,
      48,
      24
    ]
  },
  "top7Tails": [
    1,
    6,
    8,
    3,
    4,
    7,
    9
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001
};