var oracleData = {
  "time": "2026-10-21 21:32:32",
  "issue": "2026294",
  "code": "29,43,10,2,34,27,28",
  "zodiac": "虎,鼠,鸡,蛇,鸡,龙,兔",
  "wave": "red,green,blue,red,red,green,green",
  "teSx": "兔",
  "teWei": "8",
  "nextIssue": "2026295",
  "ninePool": [
    "鸡",
    "狗",
    "牛",
    "龙",
    "猪",
    "蛇",
    "猴",
    "鼠",
    "马"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "牛",
    "龙",
    "猪",
    "蛇"
  ],
  "killZodiacs": [
    "鸡",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "牛",
    "龙",
    "猪",
    "蛇",
    "猴",
    "鼠",
    "马"
  ],
  "numbers": [
    10,
    21,
    6,
    3,
    20,
    2,
    33,
    30,
    22,
    42,
    32,
    34
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "狗": [
      21,
      33
    ],
    "牛": [
      6,
      30,
      42
    ],
    "龙": [
      3
    ],
    "猪": [
      20,
      32
    ],
    "蛇": [
      2
    ]
  },
  "top7Tails": [
    1,
    3,
    0,
    2,
    4,
    6,
    7
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 54.0
};