var oracleData = {
  "time": "2026-07-03 21:32:32",
  "issue": "2026184",
  "code": "44,24,11,36,25,20,1",
  "zodiac": "猪,羊,猴,羊,马,猪,马",
  "wave": "green,red,green,blue,blue,blue,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026185",
  "ninePool": [
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛",
    "虎",
    "兔",
    "猪",
    "鸡"
  ],
  "sixPool": [
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛",
    "虎"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "rangeZodiacs": [
    "猴",
    "羊",
    "狗",
    "鼠",
    "牛",
    "虎",
    "兔",
    "猪",
    "鸡"
  ],
  "numbers": [
    23,
    12,
    33,
    7,
    42,
    17,
    43,
    47,
    30,
    35,
    45,
    5
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      47,
      35
    ],
    "羊": [
      12
    ],
    "狗": [
      33,
      45
    ],
    "鼠": [
      7,
      43
    ],
    "牛": [
      42,
      30
    ],
    "虎": [
      17,
      5
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    0,
    5,
    6,
    8
  ],
  "dynamicRate9": 80.95238095238095,
  "dynamicRate6": 64.28571428571429
};