var oracleData = {
  "time": "2026-10-17 21:32:32",
  "issue": "2026290",
  "code": "8,9,17,15,7,2,40",
  "zodiac": "猪,狗,虎,龙,鼠,蛇,兔",
  "wave": "red,blue,green,blue,red,red,red",
  "teSx": "兔",
  "teWei": "0",
  "nextIssue": "2026291",
  "ninePool": [
    "狗",
    "牛",
    "鸡",
    "龙",
    "羊",
    "虎",
    "鼠",
    "马",
    "猴"
  ],
  "sixPool": [
    "狗",
    "牛",
    "鸡",
    "龙",
    "羊",
    "虎"
  ],
  "killZodiacs": [
    "羊",
    "兔"
  ],
  "rangeZodiacs": [
    "狗",
    "牛",
    "鸡",
    "龙",
    "羊",
    "虎",
    "鼠",
    "马",
    "猴"
  ],
  "numbers": [
    21,
    6,
    46,
    27,
    36,
    17,
    41,
    30,
    10,
    42,
    22,
    12
  ],
  "zodiacNumMap": {
    "狗": [
      21
    ],
    "牛": [
      6,
      30,
      42
    ],
    "鸡": [
      46,
      10,
      22
    ],
    "龙": [
      27
    ],
    "羊": [
      36,
      12
    ],
    "虎": [
      17,
      41
    ]
  },
  "top7Tails": [
    1,
    6,
    7,
    0,
    2,
    3,
    4
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};