var oracleData = {
  "time": "2026-06-07 21:32:32",
  "issue": "2026158",
  "code": "43,48,3,1,12,23,16",
  "zodiac": "鼠,羊,龙,马,羊,猴,兔",
  "wave": "green,blue,blue,red,red,red,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026159",
  "ninePool": [
    "鸡",
    "蛇",
    "猪",
    "牛",
    "羊",
    "狗",
    "猴",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猪",
    "牛",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "龙",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "猪",
    "牛",
    "羊",
    "狗",
    "猴",
    "鼠",
    "虎"
  ],
  "numbers": [
    22,
    2,
    32,
    6,
    12,
    33,
    42,
    34,
    14,
    44,
    24,
    46
  ],
  "zodiacNumMap": {
    "鸡": [
      22,
      34,
      46
    ],
    "蛇": [
      2,
      14
    ],
    "猪": [
      32,
      44
    ],
    "牛": [
      6,
      42
    ],
    "羊": [
      12,
      24
    ],
    "狗": [
      33
    ]
  },
  "top7Tails": [
    2,
    3,
    4,
    6,
    0,
    5,
    8
  ],
  "dynamicRate9": 75.0,
  "dynamicRate6": 62.5
};