var oracleData = {
  "time": "2026-07-27 21:32:32",
  "issue": "2026208",
  "code": "7,48,40,35,23,28,19",
  "zodiac": "鼠,羊,兔,猴,猴,兔,鼠",
  "wave": "red,blue,red,red,red,green,red",
  "teSx": "鼠",
  "teWei": "9",
  "nextIssue": "2026209",
  "ninePool": [
    "牛",
    "鸡",
    "狗",
    "猴",
    "虎",
    "龙",
    "蛇",
    "猪",
    "兔"
  ],
  "sixPool": [
    "牛",
    "鸡",
    "狗",
    "猴",
    "虎",
    "龙"
  ],
  "killZodiacs": [
    "龙",
    "鼠"
  ],
  "rangeZodiacs": [
    "牛",
    "鸡",
    "狗",
    "猴",
    "虎",
    "龙",
    "蛇",
    "猪",
    "兔"
  ],
  "numbers": [
    18,
    34,
    9,
    11,
    29,
    3,
    30,
    10,
    21,
    41,
    42,
    22
  ],
  "zodiacNumMap": {
    "牛": [
      18,
      30,
      42
    ],
    "鸡": [
      34,
      10,
      22
    ],
    "狗": [
      9,
      21
    ],
    "猴": [
      11
    ],
    "虎": [
      29,
      41
    ],
    "龙": [
      3
    ]
  },
  "top7Tails": [
    4,
    8,
    0,
    1,
    2,
    3,
    6
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 64.0
};