var oracleData = {
  "time": "2026-07-08 21:32:32",
  "issue": "2026189",
  "code": "45,12,37,20,38,43,15",
  "zodiac": "狗,羊,马,猪,蛇,鼠,龙",
  "wave": "red,red,blue,blue,green,green,blue",
  "teSx": "龙",
  "teWei": "5",
  "nextIssue": "2026190",
  "ninePool": [
    "鸡",
    "马",
    "猴",
    "狗",
    "鼠",
    "蛇",
    "猪",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "马",
    "猴",
    "狗",
    "鼠",
    "蛇"
  ],
  "killZodiacs": [
    "龙",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "马",
    "猴",
    "狗",
    "鼠",
    "蛇",
    "猪",
    "牛",
    "羊"
  ],
  "numbers": [
    10,
    37,
    47,
    9,
    7,
    2,
    22,
    38,
    13,
    23,
    33,
    43
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "马": [
      37,
      13
    ],
    "猴": [
      47,
      23
    ],
    "狗": [
      9,
      33
    ],
    "鼠": [
      7,
      43
    ],
    "蛇": [
      2,
      38
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    8,
    3,
    4,
    5
  ],
  "dynamicRate9": 82.97872340425532,
  "dynamicRate6": 68.08510638297872
};