var oracleData = {
  "time": "2026-08-08 21:32:32",
  "issue": "2026220",
  "code": "27,39,4,12,38,25,48",
  "zodiac": "龙,龙,兔,羊,蛇,马,羊",
  "wave": "green,green,blue,red,green,blue,blue",
  "teSx": "羊",
  "teWei": "8",
  "nextIssue": "2026221",
  "ninePool": [
    "鸡",
    "狗",
    "猪",
    "蛇",
    "马",
    "兔",
    "牛",
    "龙",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "猪",
    "蛇",
    "马",
    "兔"
  ],
  "killZodiacs": [
    "牛",
    "羊"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "猪",
    "蛇",
    "马",
    "兔",
    "牛",
    "龙",
    "猴"
  ],
  "numbers": [
    10,
    9,
    8,
    2,
    1,
    28,
    20,
    40,
    22,
    32,
    38,
    21
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "狗": [
      9,
      21
    ],
    "猪": [
      8,
      20,
      32
    ],
    "蛇": [
      2,
      38
    ],
    "马": [
      1
    ],
    "兔": [
      28,
      40
    ]
  },
  "top7Tails": [
    0,
    2,
    8,
    1,
    3,
    5,
    9
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 57.99999999999999
};