var oracleData = {
  "time": "2026-08-29 21:32:32",
  "issue": "2026241",
  "code": "29,45,27,21,42,41,49",
  "zodiac": "虎,狗,龙,狗,牛,虎,马",
  "wave": "red,red,green,green,blue,blue,green",
  "teSx": "马",
  "teWei": "9",
  "nextIssue": "2026242",
  "ninePool": [
    "鸡",
    "狗",
    "虎",
    "龙",
    "牛",
    "羊",
    "猴",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "虎",
    "龙",
    "牛",
    "羊"
  ],
  "killZodiacs": [
    "羊",
    "马"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "虎",
    "龙",
    "牛",
    "羊",
    "猴",
    "兔",
    "蛇"
  ],
  "numbers": [
    34,
    33,
    5,
    3,
    6,
    24,
    46,
    36,
    18,
    48,
    10,
    30
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      46,
      10
    ],
    "狗": [
      33
    ],
    "虎": [
      5
    ],
    "龙": [
      3
    ],
    "牛": [
      6,
      18,
      30
    ],
    "羊": [
      24,
      36,
      48
    ]
  },
  "top7Tails": [
    3,
    4,
    6,
    8,
    0,
    1,
    5
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 48.0
};