var oracleData = {
  "time": "2026-08-31 21:32:32",
  "issue": "2026243",
  "code": "42,17,12,46,9,24,21",
  "zodiac": "牛,虎,羊,鸡,狗,羊,狗",
  "wave": "blue,green,red,red,blue,red,green",
  "teSx": "狗",
  "teWei": "1",
  "nextIssue": "2026244",
  "ninePool": [
    "鸡",
    "兔",
    "鼠",
    "虎",
    "龙",
    "马",
    "牛",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "鼠",
    "虎",
    "龙",
    "马"
  ],
  "killZodiacs": [
    "猪",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "鼠",
    "虎",
    "龙",
    "马",
    "牛",
    "蛇",
    "猪"
  ],
  "numbers": [
    10,
    4,
    43,
    5,
    3,
    13,
    40,
    34,
    46,
    16,
    28,
    31
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46
    ],
    "兔": [
      4,
      40,
      16,
      28
    ],
    "鼠": [
      43,
      31
    ],
    "虎": [
      5
    ],
    "龙": [
      3
    ],
    "马": [
      13
    ]
  },
  "top7Tails": [
    0,
    3,
    4,
    6,
    8,
    1,
    5
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 52.0
};