var oracleData = {
  "time": "2026-10-25 21:32:32",
  "issue": "2026298",
  "code": "31,36,40,34,37,43,8",
  "zodiac": "鼠,羊,兔,鸡,马,鼠,猪",
  "wave": "blue,blue,red,red,blue,green,red",
  "teSx": "猪",
  "teWei": "8",
  "nextIssue": "2026299",
  "ninePool": [
    "狗",
    "鸡",
    "牛",
    "羊",
    "猴",
    "蛇",
    "虎",
    "龙",
    "鼠"
  ],
  "sixPool": [
    "狗",
    "鸡",
    "牛",
    "羊",
    "猴",
    "蛇"
  ],
  "killZodiacs": [
    "龙",
    "猪"
  ],
  "rangeZodiacs": [
    "狗",
    "鸡",
    "牛",
    "羊",
    "猴",
    "蛇",
    "虎",
    "龙",
    "鼠"
  ],
  "numbers": [
    9,
    22,
    42,
    12,
    11,
    2,
    21,
    34,
    24,
    14,
    10,
    30
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21
    ],
    "鸡": [
      22,
      34,
      10
    ],
    "牛": [
      42,
      30
    ],
    "羊": [
      12,
      24
    ],
    "猴": [
      11
    ],
    "蛇": [
      2,
      14
    ]
  },
  "top7Tails": [
    1,
    2,
    4,
    9,
    0,
    6,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 50.0
};