var oracleData = {
  "time": "2026-07-13 21:32:32",
  "issue": "2026194",
  "code": "30,21,22,15,4,34,26",
  "zodiac": "牛,狗,鸡,龙,兔,鸡,蛇",
  "wave": "red,green,green,blue,blue,red,blue",
  "teSx": "蛇",
  "teWei": "6",
  "nextIssue": "2026195",
  "ninePool": [
    "猪",
    "鸡",
    "牛",
    "兔",
    "羊",
    "猴",
    "鼠",
    "龙",
    "马"
  ],
  "sixPool": [
    "猪",
    "鸡",
    "牛",
    "兔",
    "羊",
    "猴"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "rangeZodiacs": [
    "猪",
    "鸡",
    "牛",
    "兔",
    "羊",
    "猴",
    "鼠",
    "龙",
    "马"
  ],
  "numbers": [
    8,
    10,
    18,
    4,
    12,
    47,
    20,
    30,
    40,
    32,
    22,
    42
  ],
  "zodiacNumMap": {
    "猪": [
      8,
      20,
      32
    ],
    "鸡": [
      10,
      22
    ],
    "牛": [
      18,
      30,
      42
    ],
    "兔": [
      4,
      40
    ],
    "羊": [
      12
    ],
    "猴": [
      47
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    7,
    8,
    3,
    1
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 68.0
};