var oracleData = {
  "time": "2026-10-23 21:32:32",
  "issue": "2026296",
  "code": "14,43,26,45,3,31,23",
  "zodiac": "蛇,鼠,蛇,狗,龙,鼠,猴",
  "wave": "blue,green,blue,red,blue,blue,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026297",
  "ninePool": [
    "狗",
    "龙",
    "鼠",
    "蛇",
    "虎",
    "猪",
    "牛",
    "鸡",
    "羊"
  ],
  "sixPool": [
    "狗",
    "龙",
    "鼠",
    "蛇",
    "虎",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "rangeZodiacs": [
    "狗",
    "龙",
    "鼠",
    "蛇",
    "虎",
    "猪",
    "牛",
    "鸡",
    "羊"
  ],
  "numbers": [
    9,
    3,
    19,
    2,
    29,
    32,
    21,
    31,
    41,
    33,
    43,
    39
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21,
      33
    ],
    "龙": [
      3,
      39
    ],
    "鼠": [
      19,
      31,
      43
    ],
    "蛇": [
      2
    ],
    "虎": [
      29,
      41
    ],
    "猪": [
      32
    ]
  },
  "top7Tails": [
    1,
    2,
    3,
    9,
    0,
    4,
    6
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 50.0
};