var oracleData = {
  "time": "2026-09-15 21:32:32",
  "issue": "2026258",
  "code": "3,23,21,35,5,19,46",
  "zodiac": "龙,猴,狗,猴,虎,鼠,鸡",
  "wave": "blue,red,green,red,green,red,red",
  "teSx": "鸡",
  "teWei": "6",
  "nextIssue": "2026259",
  "ninePool": [
    "羊",
    "龙",
    "狗",
    "兔",
    "蛇",
    "牛",
    "虎",
    "马",
    "猴"
  ],
  "sixPool": [
    "羊",
    "龙",
    "狗",
    "兔",
    "蛇",
    "牛"
  ],
  "killZodiacs": [
    "蛇",
    "鸡"
  ],
  "rangeZodiacs": [
    "羊",
    "龙",
    "狗",
    "兔",
    "蛇",
    "牛",
    "虎",
    "马",
    "猴"
  ],
  "numbers": [
    48,
    15,
    9,
    28,
    38,
    18,
    45,
    39,
    21,
    3,
    33,
    36
  ],
  "zodiacNumMap": {
    "羊": [
      48,
      36
    ],
    "龙": [
      15,
      39,
      3
    ],
    "狗": [
      9,
      45,
      21,
      33
    ],
    "兔": [
      28
    ],
    "蛇": [
      38
    ],
    "牛": [
      18
    ]
  },
  "top7Tails": [
    5,
    8,
    9,
    1,
    3,
    6,
    7
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001
};