var oracleData = {
  "time": "2026-08-02 21:32:32",
  "issue": "2026214",
  "code": "29,30,27,38,43,31,4",
  "zodiac": "虎,牛,龙,蛇,鼠,鼠,兔",
  "wave": "red,red,green,green,green,blue,blue",
  "teSx": "兔",
  "teWei": "4",
  "nextIssue": "2026215",
  "ninePool": [
    "鸡",
    "狗",
    "蛇",
    "羊",
    "牛",
    "龙",
    "虎",
    "马",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "蛇",
    "羊",
    "牛",
    "龙"
  ],
  "killZodiacs": [
    "狗",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "蛇",
    "羊",
    "牛",
    "龙",
    "虎",
    "马",
    "猴"
  ],
  "numbers": [
    10,
    33,
    2,
    12,
    30,
    3,
    22,
    42,
    34,
    14,
    24,
    46
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34,
      46
    ],
    "狗": [
      33
    ],
    "蛇": [
      2,
      14
    ],
    "羊": [
      12,
      24
    ],
    "牛": [
      30,
      42
    ],
    "龙": [
      3
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    3,
    6,
    7,
    8
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 62.0
};