var oracleData = {
  "time": "2026-07-19 21:32:32",
  "issue": "2026200",
  "code": "43,46,5,32,35,29,39",
  "zodiac": "鼠,鸡,虎,猪,猴,虎,龙",
  "wave": "green,red,green,green,red,red,green",
  "teSx": "龙",
  "teWei": "9",
  "nextIssue": "2026201",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "虎",
    "兔",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "虎"
  ],
  "killZodiacs": [
    "马",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "虎",
    "兔",
    "猪",
    "蛇"
  ],
  "numbers": [
    10,
    30,
    11,
    21,
    31,
    41,
    22,
    42,
    23,
    33,
    43,
    34
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "牛": [
      30,
      42
    ],
    "猴": [
      11,
      23
    ],
    "狗": [
      21,
      33
    ],
    "鼠": [
      31,
      43
    ],
    "虎": [
      41
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 66.0
};