var oracleData = {
  "time": "2026-07-20 21:32:32",
  "issue": "2026201",
  "code": "46,28,19,38,31,25,32",
  "zodiac": "鸡,兔,鼠,蛇,鼠,马,猪",
  "wave": "red,green,red,green,blue,blue,green",
  "teSx": "猪",
  "teWei": "2",
  "nextIssue": "2026202",
  "ninePool": [
    "牛",
    "兔",
    "猴",
    "虎",
    "蛇",
    "羊",
    "鼠",
    "龙",
    "马"
  ],
  "sixPool": [
    "牛",
    "兔",
    "猴",
    "虎",
    "蛇",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "猪"
  ],
  "rangeZodiacs": [
    "牛",
    "兔",
    "猴",
    "虎",
    "蛇",
    "羊",
    "鼠",
    "龙",
    "马"
  ],
  "numbers": [
    30,
    4,
    11,
    41,
    2,
    12,
    40,
    42,
    23,
    14,
    24,
    47
  ],
  "zodiacNumMap": {
    "牛": [
      30,
      42
    ],
    "兔": [
      4,
      40
    ],
    "猴": [
      11,
      23,
      47
    ],
    "虎": [
      41
    ],
    "蛇": [
      2,
      14
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 64.0
};