var oracleData = {
  "time": "2026-05-25 21:32:32",
  "issue": "2026145",
  "code": "36,43,25,32,37,18,5",
  "zodiac": "羊,鼠,马,猪,马,牛,虎",
  "wave": "blue,green,blue,green,blue,red,green",
  "teSx": "虎",
  "teWei": "5",
  "nextIssue": "2026146",
  "ninePool": [
    "龙",
    "鸡",
    "马",
    "猴",
    "狗",
    "猪",
    "鼠",
    "羊",
    "牛"
  ],
  "sixPool": [
    "龙",
    "鸡",
    "马",
    "猴",
    "狗",
    "猪"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "鸡",
    "马",
    "猴",
    "狗",
    "猪",
    "鼠",
    "羊",
    "牛"
  ],
  "numbers": [
    15,
    22,
    1,
    11,
    21,
    32,
    25,
    35,
    45,
    27,
    37,
    47
  ],
  "zodiacNumMap": {
    "龙": [
      15,
      27
    ],
    "鸡": [
      22
    ],
    "马": [
      1,
      25,
      37
    ],
    "猴": [
      11,
      35,
      47
    ],
    "狗": [
      21,
      45
    ],
    "猪": [
      32
    ]
  },
  "top7Tails": [
    1,
    2,
    5,
    7,
    0,
    8,
    9
  ],
  "dynamicRate9": 66.66666666666666,
  "dynamicRate6": 33.33333333333333
};