var oracleData = {
  "time": "2026-07-02 21:32:32",
  "issue": "2026183",
  "code": "23,9,46,37,42,3,24",
  "zodiac": "猴,狗,鸡,马,牛,龙,羊",
  "wave": "red,blue,red,blue,blue,blue,red",
  "teSx": "羊",
  "teWei": "4",
  "nextIssue": "2026184",
  "ninePool": [
    "猴",
    "兔",
    "马",
    "猪",
    "蛇",
    "鸡",
    "虎",
    "龙",
    "狗"
  ],
  "sixPool": [
    "猴",
    "兔",
    "马",
    "猪",
    "蛇",
    "鸡"
  ],
  "killZodiacs": [
    "羊",
    "羊"
  ],
  "rangeZodiacs": [
    "猴",
    "兔",
    "马",
    "猪",
    "蛇",
    "鸡",
    "虎",
    "龙",
    "狗"
  ],
  "numbers": [
    23,
    4,
    13,
    32,
    2,
    22,
    47,
    37,
    40,
    20,
    10,
    44
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      47
    ],
    "兔": [
      4,
      40
    ],
    "马": [
      13,
      37
    ],
    "猪": [
      32,
      20,
      44
    ],
    "蛇": [
      2
    ],
    "鸡": [
      22,
      10
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    0,
    4,
    5,
    8
  ],
  "dynamicRate9": 80.95238095238095,
  "dynamicRate6": 64.28571428571429
};