var oracleData = {
  "time": "2026-09-02 21:32:32",
  "issue": "2026245",
  "code": "22,23,14,2,13,38,18",
  "zodiac": "鸡,猴,蛇,蛇,马,蛇,牛",
  "wave": "green,red,blue,red,red,green,red",
  "teSx": "牛",
  "teWei": "8",
  "nextIssue": "2026246",
  "ninePool": [
    "蛇",
    "鼠",
    "兔",
    "马",
    "羊",
    "猪",
    "猴",
    "狗",
    "虎"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "兔",
    "马",
    "羊",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "牛"
  ],
  "rangeZodiacs": [
    "蛇",
    "鼠",
    "兔",
    "马",
    "羊",
    "猪",
    "猴",
    "狗",
    "虎"
  ],
  "numbers": [
    14,
    43,
    4,
    13,
    24,
    8,
    40,
    20,
    44,
    38,
    28,
    48
  ],
  "zodiacNumMap": {
    "蛇": [
      14,
      38
    ],
    "鼠": [
      43
    ],
    "兔": [
      4,
      40,
      28
    ],
    "马": [
      13
    ],
    "羊": [
      24,
      48
    ],
    "猪": [
      8,
      20,
      44
    ]
  },
  "top7Tails": [
    0,
    3,
    4,
    8,
    5,
    6,
    1
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 50.0
};