var oracleData = {
  "time": "2026-06-10 21:32:32",
  "issue": "2026161",
  "code": "36,40,42,19,34,46,8",
  "zodiac": "羊,兔,牛,鼠,鸡,鸡,猪",
  "wave": "blue,red,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": "8",
  "nextIssue": "2026162",
  "ninePool": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "鼠",
    "猪"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "牛",
    "虎",
    "兔",
    "蛇",
    "狗",
    "鼠",
    "龙"
  ],
  "numbers": [
    34,
    23,
    18,
    5,
    4,
    14,
    28,
    38,
    10,
    30,
    40,
    22
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      22
    ],
    "猴": [
      23
    ],
    "牛": [
      18,
      30
    ],
    "虎": [
      5
    ],
    "兔": [
      4,
      28,
      40
    ],
    "蛇": [
      14,
      38
    ]
  },
  "top7Tails": [
    3,
    4,
    8,
    0,
    2,
    5,
    6
  ],
  "dynamicRate9": 68.42105263157895,
  "dynamicRate6": 57.89473684210527
};