var oracleData = {
  "time": "2026-09-23 21:32:32",
  "issue": "2026266",
  "code": "38,42,37,29,45,18,8",
  "zodiac": "蛇,牛,马,虎,狗,牛,猪",
  "wave": "green,blue,blue,red,red,red,red",
  "teSx": "猪",
  "teWei": "8",
  "nextIssue": "2026267",
  "ninePool": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "猴",
    "鸡",
    "牛",
    "羊",
    "鼠"
  ],
  "sixPool": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "猴",
    "鸡"
  ],
  "killZodiacs": [
    "狗",
    "猪"
  ],
  "rangeZodiacs": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "猴",
    "鸡",
    "牛",
    "羊",
    "鼠"
  ],
  "numbers": [
    5,
    3,
    28,
    38,
    23,
    22,
    15,
    35,
    2,
    4,
    14,
    34
  ],
  "zodiacNumMap": {
    "虎": [
      5
    ],
    "龙": [
      3,
      15
    ],
    "兔": [
      28,
      4
    ],
    "蛇": [
      38,
      2,
      14
    ],
    "猴": [
      23,
      35
    ],
    "鸡": [
      22,
      34
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    2,
    4,
    6,
    7
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};