var oracleData = {
  "time": "2026-10-02 21:32:32",
  "issue": "2026275",
  "code": "42,49,4,47,14,43,17",
  "zodiac": "牛,马,兔,猴,蛇,鼠,虎",
  "wave": "blue,green,blue,blue,blue,green,green",
  "teSx": "虎",
  "teWei": "7",
  "nextIssue": "2026276",
  "ninePool": [
    "龙",
    "蛇",
    "马",
    "猴",
    "猪",
    "鼠",
    "羊",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "龙",
    "蛇",
    "马",
    "猴",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "兔",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "蛇",
    "马",
    "猴",
    "猪",
    "鼠",
    "羊",
    "牛",
    "鸡"
  ],
  "numbers": [
    27,
    14,
    1,
    11,
    44,
    7,
    31,
    26,
    37,
    47,
    3,
    13
  ],
  "zodiacNumMap": {
    "龙": [
      27,
      3
    ],
    "蛇": [
      14,
      26
    ],
    "马": [
      1,
      37,
      13
    ],
    "猴": [
      11,
      47
    ],
    "猪": [
      44
    ],
    "鼠": [
      7,
      31
    ]
  },
  "top7Tails": [
    1,
    4,
    6,
    7,
    3,
    8,
    0
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999
};