var oracleData = {
  "time": "2026-06-08 21:32:32",
  "issue": "2026159",
  "code": "12,4,28,17,20,46,39",
  "zodiac": "羊,兔,兔,虎,猪,鸡,龙",
  "wave": "red,blue,green,green,blue,red,green",
  "teSx": "龙",
  "teWei": "9",
  "nextIssue": "2026160",
  "ninePool": [
    "鸡",
    "蛇",
    "猴",
    "鼠",
    "虎",
    "马",
    "猪",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "蛇",
    "猴",
    "鼠",
    "虎",
    "马"
  ],
  "killZodiacs": [
    "鼠",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "蛇",
    "猴",
    "鼠",
    "虎",
    "马",
    "猪",
    "牛",
    "羊"
  ],
  "numbers": [
    22,
    2,
    23,
    43,
    5,
    13,
    34,
    14,
    38,
    10,
    35,
    25
  ],
  "zodiacNumMap": {
    "鸡": [
      22,
      34,
      10
    ],
    "蛇": [
      2,
      14,
      38
    ],
    "猴": [
      23,
      35
    ],
    "鼠": [
      43
    ],
    "虎": [
      5
    ],
    "马": [
      13,
      25
    ]
  },
  "top7Tails": [
    2,
    3,
    4,
    8,
    0,
    5,
    6
  ],
  "dynamicRate9": 70.58823529411765,
  "dynamicRate6": 58.82352941176471
};