var oracleData = {
  "time": "2026-10-01 21:32:32",
  "issue": "2026274",
  "code": "12,16,32,5,39,36,33",
  "zodiac": "羊,兔,猪,虎,龙,羊,狗",
  "wave": "red,green,green,green,green,blue,green",
  "teSx": "狗",
  "teWei": "3",
  "nextIssue": "2026275",
  "ninePool": [
    "龙",
    "马",
    "猴",
    "鸡",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "龙",
    "马",
    "猴",
    "鸡",
    "鼠",
    "羊"
  ],
  "killZodiacs": [
    "鼠",
    "狗"
  ],
  "rangeZodiacs": [
    "龙",
    "马",
    "猴",
    "鸡",
    "鼠",
    "羊",
    "牛",
    "蛇",
    "猪"
  ],
  "numbers": [
    3,
    13,
    23,
    34,
    7,
    24,
    43,
    46,
    36,
    27,
    37,
    47
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      27
    ],
    "马": [
      13,
      37
    ],
    "猴": [
      23,
      47
    ],
    "鸡": [
      34,
      46
    ],
    "鼠": [
      7,
      43
    ],
    "羊": [
      24,
      36
    ]
  },
  "top7Tails": [
    3,
    4,
    6,
    7,
    1,
    8,
    0
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 57.99999999999999
};