var oracleData = {
  "time": "2026-05-28 21:32:32",
  "issue": "2026148",
  "code": "28,24,31,23,4,27,48",
  "zodiac": "兔,羊,鼠,猴,兔,龙,羊",
  "wave": "green,red,blue,red,blue,green,blue",
  "teSx": "羊",
  "teWei": "8",
  "nextIssue": "2026149",
  "ninePool": [
    "鸡",
    "龙",
    "蛇",
    "兔",
    "马",
    "鼠",
    "猪",
    "猴",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "蛇",
    "兔",
    "马",
    "鼠"
  ],
  "killZodiacs": [
    "龙",
    "羊"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "蛇",
    "兔",
    "马",
    "鼠",
    "猪",
    "猴",
    "狗"
  ],
  "numbers": [
    10,
    27,
    38,
    28,
    1,
    7,
    40,
    31,
    37,
    22,
    2,
    15
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "龙": [
      27,
      15
    ],
    "蛇": [
      38,
      2
    ],
    "兔": [
      28,
      40
    ],
    "马": [
      1,
      37
    ],
    "鼠": [
      7,
      31
    ]
  },
  "top7Tails": [
    0,
    1,
    7,
    8,
    2,
    5,
    6
  ],
  "dynamicRate9": 83.33333333333334,
  "dynamicRate6": 50.0
};