var oracleData = {
  "time": "2026-08-11 21:32:32",
  "issue": "2026223",
  "code": "21,43,1,38,29,44,23",
  "zodiac": "狗,鼠,马,蛇,虎,猪,猴",
  "wave": "green,green,red,green,red,green,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026224",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "猪",
    "虎",
    "蛇",
    "马",
    "兔",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "猪",
    "虎",
    "蛇"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "龙",
    "猪",
    "虎",
    "蛇",
    "马",
    "兔",
    "羊"
  ],
  "numbers": [
    10,
    9,
    39,
    20,
    29,
    2,
    22,
    32,
    21,
    41,
    33,
    3
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "狗": [
      9,
      21,
      33
    ],
    "龙": [
      39,
      3
    ],
    "猪": [
      20,
      32
    ],
    "虎": [
      29,
      41
    ],
    "蛇": [
      2
    ]
  },
  "top7Tails": [
    0,
    2,
    9,
    1,
    3,
    5,
    8
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 60.0
};