var oracleData = {
  "time": "2026-08-24 21:32:32",
  "issue": "2026236",
  "code": "26,35,42,9,14,17,11",
  "zodiac": "蛇,猴,牛,狗,蛇,虎,猴",
  "wave": "blue,red,blue,blue,blue,green,green",
  "teSx": "猴",
  "teWei": "1",
  "nextIssue": "2026237",
  "ninePool": [
    "鸡",
    "马",
    "狗",
    "蛇",
    "虎",
    "猪",
    "鼠",
    "羊",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "马",
    "狗",
    "蛇",
    "虎",
    "猪"
  ],
  "killZodiacs": [
    "蛇",
    "猴"
  ],
  "rangeZodiacs": [
    "鸡",
    "马",
    "狗",
    "蛇",
    "虎",
    "猪",
    "鼠",
    "羊",
    "牛"
  ],
  "numbers": [
    34,
    1,
    21,
    14,
    5,
    44,
    41,
    25,
    45,
    10,
    20,
    13
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "马": [
      1,
      25,
      13
    ],
    "狗": [
      21,
      45
    ],
    "蛇": [
      14
    ],
    "虎": [
      5,
      41
    ],
    "猪": [
      44,
      20
    ]
  },
  "top7Tails": [
    1,
    4,
    5,
    0,
    3,
    8,
    9
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 54.0
};