var oracleData = {
  "time": "2026-09-06 21:32:32",
  "issue": "2026249",
  "code": "41,22,13,36,26,29,23",
  "zodiac": "虎,鸡,马,羊,蛇,虎,猴",
  "wave": "blue,green,red,blue,blue,red,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026250",
  "ninePool": [
    "蛇",
    "鼠",
    "马",
    "龙",
    "狗",
    "虎",
    "羊",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "蛇",
    "鼠",
    "马",
    "龙",
    "狗",
    "虎"
  ],
  "killZodiacs": [
    "马",
    "猴"
  ],
  "rangeZodiacs": [
    "蛇",
    "鼠",
    "马",
    "龙",
    "狗",
    "虎",
    "羊",
    "鸡",
    "牛"
  ],
  "numbers": [
    2,
    43,
    13,
    3,
    33,
    5,
    14,
    31,
    1,
    21,
    41,
    25
  ],
  "zodiacNumMap": {
    "蛇": [
      2,
      14
    ],
    "鼠": [
      43,
      31
    ],
    "马": [
      13,
      1,
      25
    ],
    "龙": [
      3
    ],
    "狗": [
      33,
      21
    ],
    "虎": [
      5,
      41
    ]
  },
  "top7Tails": [
    2,
    3,
    4,
    1,
    5,
    6,
    7
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 52.0
};