var oracleData = {
  "time": "2026-09-10 21:32:32",
  "issue": "2026253",
  "code": "5,35,15,28,13,49,16",
  "zodiac": "虎,猴,龙,兔,马,马,兔",
  "wave": "green,red,blue,green,red,green,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026254",
  "ninePool": [
    "羊",
    "龙",
    "狗",
    "猪",
    "牛",
    "马",
    "鼠",
    "虎",
    "猴"
  ],
  "sixPool": [
    "羊",
    "龙",
    "狗",
    "猪",
    "牛",
    "马"
  ],
  "killZodiacs": [
    "蛇",
    "兔"
  ],
  "rangeZodiacs": [
    "羊",
    "龙",
    "狗",
    "猪",
    "牛",
    "马",
    "鼠",
    "虎",
    "猴"
  ],
  "numbers": [
    12,
    15,
    9,
    8,
    6,
    25,
    45,
    27,
    37,
    39,
    21,
    1
  ],
  "zodiacNumMap": {
    "羊": [
      12
    ],
    "龙": [
      15,
      27,
      39
    ],
    "狗": [
      9,
      45,
      21
    ],
    "猪": [
      8
    ],
    "牛": [
      6
    ],
    "马": [
      25,
      37,
      1
    ]
  },
  "top7Tails": [
    5,
    7,
    9,
    1,
    2,
    3,
    4
  ],
  "dynamicRate9": 82.0,
  "dynamicRate6": 56.00000000000001
};