var oracleData = {
  "time": "2026-07-09 21:32:32",
  "issue": "2026190",
  "code": "46,14,19,37,48,29,16",
  "zodiac": "鸡,蛇,鼠,马,羊,虎,兔",
  "wave": "red,blue,red,blue,blue,red,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026191",
  "ninePool": [
    "鸡",
    "猪",
    "牛",
    "蛇",
    "狗",
    "羊",
    "猴",
    "鼠",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "牛",
    "蛇",
    "狗",
    "羊"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "猪",
    "牛",
    "蛇",
    "狗",
    "羊",
    "猴",
    "鼠",
    "虎"
  ],
  "numbers": [
    10,
    8,
    18,
    2,
    9,
    12,
    20,
    30,
    22,
    32,
    42,
    38
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "猪": [
      8,
      20,
      32
    ],
    "牛": [
      18,
      30,
      42
    ],
    "蛇": [
      2,
      38
    ],
    "狗": [
      9
    ],
    "羊": [
      12
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    8,
    3,
    4,
    5
  ],
  "dynamicRate9": 83.33333333333334,
  "dynamicRate6": 68.75
};