var oracleData = {
  "time": "2026-08-03 21:32:32",
  "issue": "2026215",
  "code": "19,38,30,13,1,11,14",
  "zodiac": "鼠,蛇,牛,马,马,猴,蛇",
  "wave": "red,green,red,red,red,green,blue",
  "teSx": "蛇",
  "teWei": "4",
  "nextIssue": "2026216",
  "ninePool": [
    "鸡",
    "狗",
    "羊",
    "虎",
    "猴",
    "猪",
    "牛",
    "马",
    "鼠"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "羊",
    "虎",
    "猴",
    "猪"
  ],
  "killZodiacs": [
    "虎",
    "蛇"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "羊",
    "虎",
    "猴",
    "猪",
    "牛",
    "马",
    "鼠"
  ],
  "numbers": [
    10,
    33,
    12,
    5,
    23,
    20,
    22,
    32,
    34,
    24,
    44,
    45
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "狗": [
      33,
      45
    ],
    "羊": [
      12,
      24
    ],
    "虎": [
      5
    ],
    "猴": [
      23
    ],
    "猪": [
      20,
      32,
      44
    ]
  },
  "top7Tails": [
    0,
    2,
    3,
    4,
    5,
    6,
    7
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 60.0
};