var oracleData = {
  "time": "2026-08-13 21:32:32",
  "issue": "2026225",
  "code": "7,34,27,10,19,38,1",
  "zodiac": "鼠,鸡,龙,鸡,鼠,蛇,马",
  "wave": "red,red,green,blue,red,green,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026226",
  "ninePool": [
    "鸡",
    "牛",
    "龙",
    "鼠",
    "虎",
    "羊",
    "兔",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "龙",
    "鼠",
    "虎",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "马"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "龙",
    "鼠",
    "虎",
    "羊",
    "兔",
    "猪",
    "蛇"
  ],
  "numbers": [
    10,
    30,
    15,
    19,
    5,
    12,
    22,
    42,
    31,
    41,
    34,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "牛": [
      30,
      42
    ],
    "龙": [
      15
    ],
    "鼠": [
      19,
      31
    ],
    "虎": [
      5,
      41
    ],
    "羊": [
      12,
      24
    ]
  },
  "top7Tails": [
    0,
    2,
    5,
    1,
    4,
    8,
    9
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 57.99999999999999
};