var oracleData = {
  "time": "2026-10-26 21:32:32",
  "issue": "2026299",
  "code": "12,19,28,32,5,42,23",
  "zodiac": "羊,鼠,兔,猪,虎,牛,猴",
  "wave": "red,red,green,green,green,blue,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026300",
  "ninePool": [
    "狗",
    "龙",
    "鼠",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "兔",
    "羊"
  ],
  "sixPool": [
    "狗",
    "龙",
    "鼠",
    "虎",
    "蛇",
    "牛"
  ],
  "killZodiacs": [
    "鸡",
    "猴"
  ],
  "rangeZodiacs": [
    "狗",
    "龙",
    "鼠",
    "虎",
    "蛇",
    "牛",
    "鸡",
    "兔",
    "羊"
  ],
  "numbers": [
    9,
    39,
    19,
    29,
    2,
    42,
    21,
    31,
    41,
    14,
    30,
    26
  ],
  "zodiacNumMap": {
    "狗": [
      9,
      21
    ],
    "龙": [
      39
    ],
    "鼠": [
      19,
      31
    ],
    "虎": [
      29,
      41
    ],
    "蛇": [
      2,
      14,
      26
    ],
    "牛": [
      42,
      30
    ]
  },
  "top7Tails": [
    1,
    2,
    4,
    9,
    0,
    6,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 48.0
};