var oracleData = {
  "time": "2026-09-26 21:32:32",
  "issue": "2026269",
  "code": "19,40,36,5,38,16,22",
  "zodiac": "鼠,兔,羊,虎,蛇,兔,鸡",
  "wave": "red,red,blue,green,green,green,green",
  "teSx": "鸡",
  "teWei": "2",
  "nextIssue": "2026270",
  "ninePool": [
    "龙",
    "虎",
    "蛇",
    "羊",
    "狗",
    "牛",
    "猴",
    "鼠",
    "马"
  ],
  "sixPool": [
    "龙",
    "虎",
    "蛇",
    "羊",
    "狗",
    "牛"
  ],
  "killZodiacs": [
    "鼠",
    "鸡"
  ],
  "rangeZodiacs": [
    "龙",
    "虎",
    "蛇",
    "羊",
    "狗",
    "牛",
    "猴",
    "鼠",
    "马"
  ],
  "numbers": [
    3,
    5,
    26,
    36,
    33,
    6,
    15,
    45,
    27,
    17,
    41,
    21
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      15,
      27
    ],
    "虎": [
      5,
      17,
      41
    ],
    "蛇": [
      26
    ],
    "羊": [
      36
    ],
    "狗": [
      33,
      45,
      21
    ],
    "牛": [
      6
    ]
  },
  "top7Tails": [
    3,
    5,
    6,
    7,
    1,
    2,
    4
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};