var oracleData = {
  "time": "2026-09-13 21:32:32",
  "issue": "2026256",
  "code": "40,15,9,37,7,3,1",
  "zodiac": "兔,龙,狗,马,鼠,龙,马",
  "wave": "red,blue,blue,blue,red,blue,red",
  "teSx": "马",
  "teWei": "1",
  "nextIssue": "2026257",
  "ninePool": [
    "鼠",
    "虎",
    "龙",
    "狗",
    "羊",
    "牛",
    "猴",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "龙",
    "狗",
    "羊",
    "牛"
  ],
  "killZodiacs": [
    "牛",
    "马"
  ],
  "rangeZodiacs": [
    "鼠",
    "虎",
    "龙",
    "狗",
    "羊",
    "牛",
    "猴",
    "兔",
    "鸡"
  ],
  "numbers": [
    7,
    5,
    15,
    9,
    48,
    18,
    31,
    41,
    21,
    45,
    17,
    27
  ],
  "zodiacNumMap": {
    "鼠": [
      7,
      31
    ],
    "虎": [
      5,
      41,
      17
    ],
    "龙": [
      15,
      27
    ],
    "狗": [
      9,
      21,
      45
    ],
    "羊": [
      48
    ],
    "牛": [
      18
    ]
  },
  "top7Tails": [
    1,
    5,
    7,
    8,
    9,
    3,
    6
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001
};