var oracleData = {
  "time": "2026-06-01 21:32:32",
  "issue": "2026152",
  "code": "34,47,16,36,44,1,45",
  "zodiac": "鸡,猴,兔,羊,猪,马,狗",
  "wave": "red,blue,green,blue,green,red,red",
  "teSx": "狗",
  "teWei": "5",
  "nextIssue": "2026153",
  "ninePool": [
    "鸡",
    "兔",
    "虎",
    "龙",
    "马",
    "猴",
    "蛇",
    "牛",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "虎",
    "龙",
    "马",
    "猴"
  ],
  "killZodiacs": [
    "蛇",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "虎",
    "龙",
    "马",
    "猴",
    "蛇",
    "牛",
    "羊"
  ],
  "numbers": [
    10,
    16,
    5,
    15,
    1,
    11,
    40,
    46,
    41,
    22,
    34,
    4
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      46,
      22,
      34
    ],
    "兔": [
      16,
      40,
      4
    ],
    "虎": [
      5,
      41
    ],
    "龙": [
      15
    ],
    "马": [
      1
    ],
    "猴": [
      11
    ]
  },
  "top7Tails": [
    0,
    6,
    1,
    2,
    4,
    5,
    7
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 70.0
};