var oracleData = {
  "time": "2026-09-16 21:32:32",
  "issue": "2026259",
  "code": "43,33,49,36,19,30,22",
  "zodiac": "鼠,狗,马,羊,鼠,牛,鸡",
  "wave": "green,green,green,blue,red,red,green",
  "teSx": "鸡",
  "teWei": "2",
  "nextIssue": "2026260",
  "ninePool": [
    "羊",
    "龙",
    "牛",
    "兔",
    "蛇",
    "虎",
    "鼠",
    "马",
    "猴"
  ],
  "sixPool": [
    "羊",
    "龙",
    "牛",
    "兔",
    "蛇",
    "虎"
  ],
  "killZodiacs": [
    "羊",
    "鸡"
  ],
  "rangeZodiacs": [
    "羊",
    "龙",
    "牛",
    "兔",
    "蛇",
    "虎",
    "鼠",
    "马",
    "猴"
  ],
  "numbers": [
    48,
    15,
    18,
    28,
    38,
    5,
    39,
    29,
    30,
    40,
    41,
    3
  ],
  "zodiacNumMap": {
    "羊": [
      48
    ],
    "龙": [
      15,
      39,
      3
    ],
    "牛": [
      18,
      30
    ],
    "兔": [
      28,
      40
    ],
    "蛇": [
      38
    ],
    "虎": [
      5,
      29,
      41
    ]
  },
  "top7Tails": [
    5,
    8,
    9,
    0,
    1,
    3,
    7
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 54.0
};