var oracleData = {
  "time": "2026-10-10 21:32:32",
  "issue": "2026283",
  "code": "35,8,15,6,21,1,18",
  "zodiac": "猴,猪,龙,牛,狗,马,牛",
  "wave": "red,red,blue,green,green,red,red",
  "teSx": "牛",
  "teWei": "8",
  "nextIssue": "2026284",
  "ninePool": [
    "羊",
    "猪",
    "鼠",
    "兔",
    "马",
    "蛇",
    "狗",
    "龙",
    "虎"
  ],
  "sixPool": [
    "羊",
    "猪",
    "鼠",
    "兔",
    "马",
    "蛇"
  ],
  "killZodiacs": [
    "猴",
    "牛"
  ],
  "rangeZodiacs": [
    "羊",
    "猪",
    "鼠",
    "兔",
    "马",
    "蛇",
    "狗",
    "龙",
    "虎"
  ],
  "numbers": [
    36,
    8,
    19,
    16,
    1,
    26,
    48,
    28,
    38,
    31,
    12,
    32
  ],
  "zodiacNumMap": {
    "羊": [
      36,
      48,
      12
    ],
    "猪": [
      8,
      32
    ],
    "鼠": [
      19,
      31
    ],
    "兔": [
      16,
      28
    ],
    "马": [
      1
    ],
    "蛇": [
      26,
      38
    ]
  },
  "top7Tails": [
    6,
    8,
    9,
    1,
    2,
    4,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001
};