var oracleData = {
  "time": "2026-09-17 21:32:32",
  "issue": "2026260",
  "code": "25,26,44,32,6,48,20",
  "zodiac": "马,蛇,猪,猪,牛,羊,猪",
  "wave": "blue,blue,green,green,green,blue,blue",
  "teSx": "猪",
  "teWei": "0",
  "nextIssue": "2026261",
  "ninePool": [
    "虎",
    "羊",
    "猴",
    "牛",
    "兔",
    "蛇",
    "鸡",
    "龙",
    "马"
  ],
  "sixPool": [
    "虎",
    "羊",
    "猴",
    "牛",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "虎",
    "猪"
  ],
  "rangeZodiacs": [
    "虎",
    "羊",
    "猴",
    "牛",
    "兔",
    "蛇",
    "鸡",
    "龙",
    "马"
  ],
  "numbers": [
    5,
    48,
    23,
    18,
    28,
    38,
    35,
    29,
    30,
    40,
    41,
    11
  ],
  "zodiacNumMap": {
    "虎": [
      5,
      29,
      41
    ],
    "羊": [
      48
    ],
    "猴": [
      23,
      35,
      11
    ],
    "牛": [
      18,
      30
    ],
    "兔": [
      28,
      40
    ],
    "蛇": [
      38
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    9,
    0,
    1,
    7
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 54.0
};