var oracleData = {
  "time": "2026-10-19 21:32:32",
  "issue": "2026292",
  "code": "39,10,18,23,16,4,36",
  "zodiac": "龙,鸡,牛,猴,兔,兔,羊",
  "wave": "green,blue,red,red,green,blue,blue",
  "teSx": "羊",
  "teWei": "6",
  "nextIssue": "2026293",
  "ninePool": [
    "鸡",
    "兔",
    "蛇",
    "马",
    "牛",
    "猪",
    "龙",
    "狗",
    "猴"
  ],
  "sixPool": [
    "鸡",
    "兔",
    "蛇",
    "马",
    "牛",
    "猪"
  ],
  "killZodiacs": [
    "马",
    "羊"
  ],
  "rangeZodiacs": [
    "鸡",
    "兔",
    "蛇",
    "马",
    "牛",
    "猪",
    "龙",
    "狗",
    "猴"
  ],
  "numbers": [
    46,
    16,
    26,
    1,
    6,
    20,
    10,
    40,
    30,
    22,
    2,
    42
  ],
  "zodiacNumMap": {
    "鸡": [
      46,
      10,
      22
    ],
    "兔": [
      16,
      40
    ],
    "蛇": [
      26,
      2
    ],
    "马": [
      1
    ],
    "牛": [
      6,
      30,
      42
    ],
    "猪": [
      20
    ]
  },
  "top7Tails": [
    1,
    6,
    0,
    2,
    3,
    4,
    5
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};