var oracleData = {
  "time": "2026-08-27 21:32:32",
  "issue": "2026239",
  "code": "47,43,34,17,22,7,5",
  "zodiac": "猴,鼠,鸡,虎,鸡,鼠,虎",
  "wave": "blue,green,red,green,green,red,green",
  "teSx": "虎",
  "teWei": "5",
  "nextIssue": "2026240",
  "ninePool": [
    "鸡",
    "狗",
    "马",
    "猪",
    "鼠",
    "龙",
    "蛇",
    "牛",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "马",
    "猪",
    "鼠",
    "龙"
  ],
  "killZodiacs": [
    "鸡",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "马",
    "猪",
    "鼠",
    "龙",
    "蛇",
    "牛",
    "兔"
  ],
  "numbers": [
    34,
    33,
    13,
    44,
    43,
    3,
    45,
    25,
    15,
    10,
    20,
    21
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "狗": [
      33,
      45,
      21
    ],
    "马": [
      13,
      25
    ],
    "猪": [
      44,
      20
    ],
    "鼠": [
      43
    ],
    "龙": [
      3,
      15
    ]
  },
  "top7Tails": [
    3,
    4,
    5,
    0,
    1,
    6,
    8
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 50.0
};