var oracleData = {
  "time": "2026-06-29 21:32:32",
  "issue": "2026180",
  "code": "14,10,37,30,49,19,21",
  "zodiac": "蛇,鸡,马,牛,马,鼠,狗",
  "wave": "blue,blue,blue,red,green,red,green",
  "teSx": "狗",
  "teWei": "1",
  "nextIssue": "2026181",
  "ninePool": [
    "猴",
    "鼠",
    "马",
    "鸡",
    "虎",
    "兔",
    "羊",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "马",
    "鸡",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "马",
    "狗"
  ],
  "rangeZodiacs": [
    "猴",
    "鼠",
    "马",
    "鸡",
    "虎",
    "兔",
    "羊",
    "蛇",
    "猪"
  ],
  "numbers": [
    47,
    7,
    37,
    22,
    17,
    40,
    19,
    29,
    10,
    11,
    31,
    1
  ],
  "zodiacNumMap": {
    "猴": [
      47,
      11
    ],
    "鼠": [
      7,
      19,
      31
    ],
    "马": [
      37,
      1
    ],
    "鸡": [
      22,
      10
    ],
    "虎": [
      17,
      29
    ],
    "兔": [
      40
    ]
  },
  "top7Tails": [
    2,
    7,
    9,
    0,
    1,
    3,
    5
  ],
  "dynamicRate9": 78.94736842105263,
  "dynamicRate6": 60.526315789473685
};