var oracleData = {
  "time": "2026-06-17 21:32:32",
  "issue": "2026168",
  "code": "27,11,24,5,40,33,15",
  "zodiac": "龙,猴,羊,虎,兔,狗,龙",
  "wave": "green,green,red,green,red,green,blue",
  "teSx": "龙",
  "teWei": "5",
  "nextIssue": "2026169",
  "ninePool": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "马",
    "狗",
    "羊",
    "蛇",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "马",
    "狗"
  ],
  "killZodiacs": [
    "蛇",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "虎",
    "兔",
    "马",
    "狗",
    "羊",
    "蛇",
    "猪"
  ],
  "numbers": [
    10,
    35,
    5,
    4,
    25,
    45,
    40,
    34,
    11,
    41,
    1,
    21
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34
    ],
    "猴": [
      35,
      11
    ],
    "虎": [
      5,
      41
    ],
    "兔": [
      4,
      40
    ],
    "马": [
      25,
      1
    ],
    "狗": [
      45,
      21
    ]
  },
  "top7Tails": [
    0,
    4,
    5,
    1,
    3,
    7,
    8
  ],
  "dynamicRate9": 73.07692307692307,
  "dynamicRate6": 57.692307692307686
};