var oracleData = {
  "time": "2026-09-18 21:32:32",
  "issue": "2026261",
  "code": "6,25,43,46,29,47,24",
  "zodiac": "牛,马,鼠,鸡,虎,猴,羊",
  "wave": "green,blue,green,red,red,blue,red",
  "teSx": "羊",
  "teWei": "4",
  "nextIssue": "2026262",
  "ninePool": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "马",
    "牛",
    "鸡",
    "猴",
    "狗"
  ],
  "sixPool": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "马",
    "牛"
  ],
  "killZodiacs": [
    "兔",
    "羊"
  ],
  "rangeZodiacs": [
    "虎",
    "龙",
    "兔",
    "蛇",
    "马",
    "牛",
    "鸡",
    "猴",
    "狗"
  ],
  "numbers": [
    5,
    3,
    28,
    38,
    13,
    18,
    15,
    25,
    29,
    39,
    41,
    1
  ],
  "zodiacNumMap": {
    "虎": [
      5,
      29,
      41
    ],
    "龙": [
      3,
      15,
      39
    ],
    "兔": [
      28
    ],
    "蛇": [
      38
    ],
    "马": [
      13,
      25,
      1
    ],
    "牛": [
      18
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    9,
    1,
    4,
    7
  ],
  "dynamicRate9": 78.0,
  "dynamicRate6": 54.0
};