var oracleData = {
  "time": "2026-10-03 21:32:32",
  "issue": "2026276",
  "code": "2,21,17,40,11,24,14",
  "zodiac": "蛇,狗,虎,兔,猴,羊,蛇",
  "wave": "red,green,green,red,green,red,blue",
  "teSx": "蛇",
  "teWei": "4",
  "nextIssue": "2026277",
  "ninePool": [
    "龙",
    "牛",
    "羊",
    "猴",
    "鸡",
    "猪",
    "兔",
    "狗",
    "鼠"
  ],
  "sixPool": [
    "龙",
    "牛",
    "羊",
    "猴",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "羊",
    "蛇"
  ],
  "rangeZodiacs": [
    "龙",
    "牛",
    "羊",
    "猴",
    "鸡",
    "猪",
    "兔",
    "狗",
    "鼠"
  ],
  "numbers": [
    3,
    6,
    24,
    11,
    34,
    44,
    36,
    46,
    23,
    27,
    47,
    18
  ],
  "zodiacNumMap": {
    "龙": [
      3,
      27
    ],
    "牛": [
      6,
      18
    ],
    "羊": [
      24,
      36
    ],
    "猴": [
      11,
      23,
      47
    ],
    "鸡": [
      34,
      46
    ],
    "猪": [
      44
    ]
  },
  "top7Tails": [
    1,
    4,
    6,
    3,
    7,
    8,
    9
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001
};