var oracleData = {
  "time": "2026-09-21 21:32:32",
  "issue": "2026264",
  "code": "10,6,8,31,22,24,21",
  "zodiac": "鸡,牛,猪,鼠,鸡,羊,狗",
  "wave": "blue,green,red,blue,green,red,green",
  "teSx": "狗",
  "teWei": "1",
  "nextIssue": "2026265",
  "ninePool": [
    "虎",
    "龙",
    "猴",
    "兔",
    "鸡",
    "鼠",
    "猪",
    "牛",
    "蛇"
  ],
  "sixPool": [
    "虎",
    "龙",
    "猴",
    "兔",
    "鸡",
    "鼠"
  ],
  "killZodiacs": [
    "狗",
    "狗"
  ],
  "rangeZodiacs": [
    "虎",
    "龙",
    "猴",
    "兔",
    "鸡",
    "鼠",
    "猪",
    "牛",
    "蛇"
  ],
  "numbers": [
    5,
    3,
    23,
    28,
    46,
    43,
    15,
    35,
    41,
    11,
    31,
    16
  ],
  "zodiacNumMap": {
    "虎": [
      5,
      41
    ],
    "龙": [
      3,
      15
    ],
    "猴": [
      23,
      35,
      11
    ],
    "兔": [
      28,
      16
    ],
    "鸡": [
      46
    ],
    "鼠": [
      43,
      31
    ]
  },
  "top7Tails": [
    3,
    5,
    8,
    1,
    6,
    7,
    9
  ],
  "dynamicRate9": 80.0,
  "dynamicRate6": 56.00000000000001
};