var oracleData = {
  "time": "2026-06-27 21:32:32",
  "issue": "2026178",
  "code": "26,46,22,44,31,17,18",
  "zodiac": "蛇,鸡,鸡,猪,鼠,虎,牛",
  "wave": "blue,red,green,green,blue,green,red",
  "teSx": "牛",
  "teWei": "8",
  "nextIssue": "2026179",
  "ninePool": [
    "猴",
    "鼠",
    "马",
    "猪",
    "兔",
    "羊",
    "狗",
    "虎",
    "龙"
  ],
  "sixPool": [
    "猴",
    "鼠",
    "马",
    "猪",
    "兔",
    "羊"
  ],
  "killZodiacs": [
    "马",
    "牛"
  ],
  "rangeZodiacs": [
    "猴",
    "鼠",
    "马",
    "猪",
    "兔",
    "羊",
    "狗",
    "虎",
    "龙"
  ],
  "numbers": [
    47,
    7,
    37,
    32,
    28,
    12,
    19,
    20,
    40,
    11,
    31,
    1
  ],
  "zodiacNumMap": {
    "猴": [
      47,
      11
    ],
    "鼠": [
      7,
      19,
      31
    ],
    "马": [
      37,
      1
    ],
    "猪": [
      32,
      20
    ],
    "兔": [
      28,
      40
    ],
    "羊": [
      12
    ]
  },
  "top7Tails": [
    2,
    7,
    9,
    0,
    1,
    3,
    5
  ],
  "dynamicRate9": 77.77777777777779,
  "dynamicRate6": 61.111111111111114
};