var oracleData = {
  "time": "2026-10-20 21:32:32",
  "issue": "2026293",
  "code": "38,10,48,49,13,9,5",
  "zodiac": "蛇,鸡,羊,马,马,狗,虎",
  "wave": "green,blue,blue,green,red,blue,green",
  "teSx": "虎",
  "teWei": "5",
  "nextIssue": "2026294",
  "ninePool": [
    "龙",
    "猴",
    "狗",
    "马",
    "猪",
    "鼠",
    "蛇",
    "鸡",
    "牛"
  ],
  "sixPool": [
    "龙",
    "猴",
    "狗",
    "马",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "马",
    "虎"
  ],
  "rangeZodiacs": [
    "龙",
    "猴",
    "狗",
    "马",
    "猪",
    "鼠",
    "蛇",
    "鸡",
    "牛"
  ],
  "numbers": [
    3,
    11,
    21,
    1,
    20,
    31,
    23,
    33,
    13,
    43,
    32,
    44
  ],
  "zodiacNumMap": {
    "龙": [
      3
    ],
    "猴": [
      11,
      23
    ],
    "狗": [
      21,
      33
    ],
    "马": [
      1,
      13
    ],
    "猪": [
      20,
      32,
      44
    ],
    "鼠": [
      31,
      43
    ]
  },
  "top7Tails": [
    1,
    3,
    0,
    2,
    4,
    5,
    6
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 54.0
};