var oracleData = {
  "time": "2026-07-24 21:32:32",
  "issue": "2026205",
  "code": "30,17,39,12,11,28,3",
  "zodiac": "牛,虎,龙,羊,猴,兔,龙",
  "wave": "red,green,green,red,green,green,blue",
  "teSx": "龙",
  "teWei": "3",
  "nextIssue": "2026206",
  "ninePool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "兔",
    "蛇",
    "猪",
    "羊"
  ],
  "sixPool": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "兔"
  ],
  "killZodiacs": [
    "猪",
    "龙"
  ],
  "rangeZodiacs": [
    "鸡",
    "牛",
    "猴",
    "狗",
    "鼠",
    "兔",
    "蛇",
    "猪",
    "羊"
  ],
  "numbers": [
    34,
    6,
    11,
    21,
    31,
    4,
    23,
    33,
    43,
    10,
    30,
    40
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10
    ],
    "牛": [
      6,
      30
    ],
    "猴": [
      11,
      23
    ],
    "狗": [
      21,
      33
    ],
    "鼠": [
      31,
      43
    ],
    "兔": [
      4,
      40
    ]
  },
  "top7Tails": [
    1,
    3,
    4,
    0,
    2,
    6,
    7
  ],
  "dynamicRate9": 88.0,
  "dynamicRate6": 64.0
};