var oracleData = {
  "time": "2026-08-07 21:32:32",
  "issue": "2026219",
  "code": "31,41,7,8,29,22,43",
  "zodiac": "鼠,虎,鼠,猪,虎,鸡,鼠",
  "wave": "blue,blue,red,red,red,green,green",
  "teSx": "鼠",
  "teWei": "3",
  "nextIssue": "2026220",
  "ninePool": [
    "鸡",
    "狗",
    "龙",
    "羊",
    "虎",
    "马",
    "猴",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "龙",
    "羊",
    "虎",
    "马"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "龙",
    "羊",
    "虎",
    "马",
    "猴",
    "兔",
    "蛇"
  ],
  "numbers": [
    10,
    33,
    3,
    12,
    5,
    13,
    22,
    21,
    41,
    1,
    45,
    15
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22
    ],
    "狗": [
      33,
      21,
      45
    ],
    "龙": [
      3,
      15
    ],
    "羊": [
      12
    ],
    "虎": [
      5,
      41
    ],
    "马": [
      13,
      1
    ]
  },
  "top7Tails": [
    0,
    2,
    3,
    1,
    5,
    8,
    9
  ],
  "dynamicRate9": 90.0,
  "dynamicRate6": 57.99999999999999
};