var oracleData = {
  "time": "2026-07-17 21:32:32",
  "issue": "2026198",
  "code": "48,35,45,21,12,24,7",
  "zodiac": "羊,猴,狗,狗,羊,羊,鼠",
  "wave": "blue,red,red,green,red,red,red",
  "teSx": "鼠",
  "teWei": "7",
  "nextIssue": "2026199",
  "ninePool": [
    "鸡",
    "羊",
    "猴",
    "牛",
    "狗",
    "虎",
    "猪",
    "蛇",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "羊",
    "猴",
    "牛",
    "狗",
    "虎"
  ],
  "killZodiacs": [
    "蛇",
    "鼠"
  ],
  "rangeZodiacs": [
    "鸡",
    "羊",
    "猴",
    "牛",
    "狗",
    "虎",
    "猪",
    "蛇",
    "兔"
  ],
  "numbers": [
    10,
    12,
    11,
    30,
    21,
    17,
    41,
    22,
    42,
    23,
    33,
    34
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "羊": [
      12
    ],
    "猴": [
      11,
      23
    ],
    "牛": [
      30,
      42
    ],
    "狗": [
      21,
      33
    ],
    "虎": [
      17,
      41
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    3,
    4,
    7,
    8
  ],
  "dynamicRate9": 84.0,
  "dynamicRate6": 68.0
};