var oracleData = {
  "time": "2026-06-15 21:32:32",
  "issue": "2026166",
  "code": "20,15,1,4,21,28,6",
  "zodiac": "猪,龙,马,兔,狗,兔,牛",
  "wave": "blue,blue,red,blue,green,green,green",
  "teSx": "牛",
  "teWei": "6",
  "nextIssue": "2026167",
  "ninePool": [
    "鸡",
    "猴",
    "鼠",
    "猪",
    "兔",
    "蛇",
    "马",
    "虎",
    "狗"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "鼠",
    "猪",
    "兔",
    "蛇"
  ],
  "killZodiacs": [
    "牛",
    "牛"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "鼠",
    "猪",
    "兔",
    "蛇",
    "马",
    "虎",
    "狗"
  ],
  "numbers": [
    34,
    35,
    7,
    44,
    4,
    14,
    10,
    20,
    40,
    23,
    43,
    46
  ],
  "zodiacNumMap": {
    "鸡": [
      34,
      10,
      46
    ],
    "猴": [
      35,
      23
    ],
    "鼠": [
      7,
      43
    ],
    "猪": [
      44,
      20
    ],
    "兔": [
      4,
      40
    ],
    "蛇": [
      14
    ]
  },
  "top7Tails": [
    4,
    5,
    0,
    3,
    6,
    7,
    8
  ],
  "dynamicRate9": 70.83333333333334,
  "dynamicRate6": 58.333333333333336
};