var oracleData = {
  "time": "2026-10-09 21:32:32",
  "issue": "2026282",
  "code": "44,3,37,46,29,20,23",
  "zodiac": "猪,龙,马,鸡,虎,猪,猴",
  "wave": "green,blue,blue,red,red,blue,red",
  "teSx": "猴",
  "teWei": "3",
  "nextIssue": "2026283",
  "ninePool": [
    "羊",
    "马",
    "虎",
    "龙",
    "蛇",
    "狗",
    "兔",
    "牛",
    "鸡"
  ],
  "sixPool": [
    "羊",
    "马",
    "虎",
    "龙",
    "蛇",
    "狗"
  ],
  "killZodiacs": [
    "牛",
    "猴"
  ],
  "rangeZodiacs": [
    "羊",
    "马",
    "虎",
    "龙",
    "蛇",
    "狗",
    "兔",
    "牛",
    "鸡"
  ],
  "numbers": [
    36,
    1,
    29,
    39,
    26,
    9,
    48,
    38,
    41,
    21,
    13,
    3
  ],
  "zodiacNumMap": {
    "羊": [
      36,
      48
    ],
    "马": [
      1,
      13
    ],
    "虎": [
      29,
      41
    ],
    "龙": [
      39,
      3
    ],
    "蛇": [
      26,
      38
    ],
    "狗": [
      9,
      21
    ]
  },
  "top7Tails": [
    6,
    8,
    9,
    1,
    3,
    4,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 57.99999999999999
};