var oracleData = {
  "time": "2026-09-11 21:32:32",
  "issue": "2026254",
  "code": "26,44,35,6,16,10,2",
  "zodiac": "蛇,猪,猴,牛,兔,鸡,蛇",
  "wave": "blue,green,red,green,green,blue,red",
  "teSx": "蛇",
  "teWei": "2",
  "nextIssue": "2026255",
  "ninePool": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "猪",
    "龙",
    "马",
    "狗"
  ],
  "sixPool": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "猪"
  ],
  "killZodiacs": [
    "猴",
    "蛇"
  ],
  "rangeZodiacs": [
    "鼠",
    "虎",
    "羊",
    "猴",
    "鸡",
    "猪",
    "龙",
    "马",
    "狗"
  ],
  "numbers": [
    7,
    5,
    12,
    11,
    22,
    8,
    31,
    41,
    35,
    17,
    47,
    19
  ],
  "zodiacNumMap": {
    "鼠": [
      7,
      31,
      19
    ],
    "虎": [
      5,
      41,
      17
    ],
    "羊": [
      12
    ],
    "猴": [
      11,
      35,
      47
    ],
    "鸡": [
      22
    ],
    "猪": [
      8
    ]
  },
  "top7Tails": [
    1,
    5,
    7,
    9,
    2,
    3,
    4
  ],
  "dynamicRate9": 82.0,
  "dynamicRate6": 56.00000000000001
};