var oracleData = {
  "time": "2026-06-03 21:32:32",
  "issue": "2026154",
  "code": "46,28,42,31,23,34,41",
  "zodiac": "鸡,兔,牛,鼠,猴,鸡,虎",
  "wave": "red,green,blue,blue,red,red,blue",
  "teSx": "虎",
  "teWei": "1",
  "nextIssue": "2026155",
  "ninePool": [
    "鸡",
    "猴",
    "猪",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "兔",
    "牛"
  ],
  "sixPool": [
    "鸡",
    "猴",
    "猪",
    "蛇",
    "狗",
    "鼠"
  ],
  "killZodiacs": [
    "鼠",
    "虎"
  ],
  "rangeZodiacs": [
    "鸡",
    "猴",
    "猪",
    "蛇",
    "狗",
    "鼠",
    "龙",
    "兔",
    "牛"
  ],
  "numbers": [
    10,
    47,
    20,
    14,
    9,
    7,
    34,
    44,
    46,
    26,
    22,
    32
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      34,
      46,
      22
    ],
    "猴": [
      47
    ],
    "猪": [
      20,
      44,
      32
    ],
    "蛇": [
      14,
      26
    ],
    "狗": [
      9
    ],
    "鼠": [
      7
    ]
  },
  "top7Tails": [
    0,
    4,
    6,
    2,
    7,
    8,
    9
  ],
  "dynamicRate9": 83.33333333333334,
  "dynamicRate6": 66.66666666666666
};