var oracleData = {
  "time": "2026-10-29 21:32:32",
  "issue": "2026302",
  "code": "10,2,14,13,11,12,45",
  "zodiac": "鸡,蛇,蛇,马,猴,羊,狗",
  "wave": "blue,red,blue,red,green,red,red",
  "teSx": "狗",
  "teWei": "5",
  "nextIssue": "2026303",
  "ninePool": [
    "鸡",
    "龙",
    "鼠",
    "猴",
    "虎",
    "兔",
    "牛",
    "羊",
    "猪"
  ],
  "sixPool": [
    "鸡",
    "龙",
    "鼠",
    "猴",
    "虎",
    "兔"
  ],
  "killZodiacs": [
    "虎",
    "狗"
  ],
  "rangeZodiacs": [
    "鸡",
    "龙",
    "鼠",
    "猴",
    "虎",
    "兔",
    "牛",
    "羊",
    "猪"
  ],
  "numbers": [
    10,
    39,
    19,
    11,
    29,
    4,
    40,
    31,
    41,
    22,
    34,
    46
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34,
      46
    ],
    "龙": [
      39
    ],
    "鼠": [
      19,
      31
    ],
    "猴": [
      11
    ],
    "虎": [
      29,
      41
    ],
    "兔": [
      4,
      40
    ]
  },
  "top7Tails": [
    0,
    1,
    2,
    4,
    9,
    6,
    7
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 48.0
};