var oracleData = {
  "time": "2026-08-18 21:32:32",
  "issue": "2026230",
  "code": "28,26,47,14,49,10,16",
  "zodiac": "兔,蛇,猴,蛇,马,鸡,兔",
  "wave": "green,blue,blue,blue,green,blue,green",
  "teSx": "兔",
  "teWei": "6",
  "nextIssue": "2026231",
  "ninePool": [
    "鸡",
    "猪",
    "龙",
    "牛",
    "羊",
    "狗",
    "鼠",
    "猴",
    "虎"
  ],
  "sixPool": [
    "鸡",
    "猪",
    "龙",
    "牛",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "虎",
    "兔"
  ],
  "rangeZodiacs": [
    "鸡",
    "猪",
    "龙",
    "牛",
    "羊",
    "狗",
    "鼠",
    "猴",
    "虎"
  ],
  "numbers": [
    10,
    20,
    15,
    30,
    12,
    45,
    22,
    32,
    42,
    34,
    44,
    24
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "猪": [
      20,
      32,
      44
    ],
    "龙": [
      15
    ],
    "牛": [
      30,
      42
    ],
    "羊": [
      12,
      24
    ],
    "狗": [
      45
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    5,
    7,
    9,
    1
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 56.00000000000001
};