var oracleData = {
  "time": "2026-09-27 21:32:32",
  "issue": "2026270",
  "code": "39,34,20,24,17,6,19",
  "zodiac": "龙,鸡,猪,羊,虎,牛,鼠",
  "wave": "green,red,blue,red,green,green,red",
  "teSx": "鼠",
  "teWei": "9",
  "nextIssue": "2026271",
  "ninePool": [
    "虎",
    "龙",
    "猴",
    "马",
    "羊",
    "狗",
    "蛇",
    "兔",
    "鸡"
  ],
  "sixPool": [
    "虎",
    "龙",
    "猴",
    "马",
    "羊",
    "狗"
  ],
  "killZodiacs": [
    "马",
    "鼠"
  ],
  "rangeZodiacs": [
    "虎",
    "龙",
    "猴",
    "马",
    "羊",
    "狗",
    "蛇",
    "兔",
    "鸡"
  ],
  "numbers": [
    5,
    3,
    23,
    13,
    36,
    33,
    15,
    35,
    25,
    45,
    17,
    27
  ],
  "zodiacNumMap": {
    "虎": [
      5,
      17
    ],
    "龙": [
      3,
      15,
      27
    ],
    "猴": [
      23,
      35
    ],
    "马": [
      13,
      25
    ],
    "羊": [
      36
    ],
    "狗": [
      33,
      45
    ]
  },
  "top7Tails": [
    3,
    5,
    6,
    7,
    1,
    2,
    4
  ],
  "dynamicRate9": 76.0,
  "dynamicRate6": 56.00000000000001
};