var oracleData = {
  "time": "2026-08-01 21:32:32",
  "issue": "2026213",
  "code": "9,5,12,22,1,15,35",
  "zodiac": "狗,虎,羊,鸡,马,龙,猴",
  "wave": "blue,green,red,green,red,blue,red",
  "teSx": "猴",
  "teWei": "5",
  "nextIssue": "2026214",
  "ninePool": [
    "鸡",
    "狗",
    "蛇",
    "马",
    "猪",
    "鼠",
    "虎",
    "羊",
    "兔"
  ],
  "sixPool": [
    "鸡",
    "狗",
    "蛇",
    "马",
    "猪",
    "鼠"
  ],
  "killZodiacs": [
    "猪",
    "猴"
  ],
  "rangeZodiacs": [
    "鸡",
    "狗",
    "蛇",
    "马",
    "猪",
    "鼠",
    "虎",
    "羊",
    "兔"
  ],
  "numbers": [
    10,
    33,
    2,
    13,
    20,
    7,
    22,
    32,
    34,
    14,
    44,
    43
  ],
  "zodiacNumMap": {
    "鸡": [
      10,
      22,
      34
    ],
    "狗": [
      33
    ],
    "蛇": [
      2,
      14
    ],
    "马": [
      13
    ],
    "猪": [
      20,
      32,
      44
    ],
    "鼠": [
      7,
      43
    ]
  },
  "top7Tails": [
    0,
    2,
    4,
    3,
    6,
    7,
    8
  ],
  "dynamicRate9": 92.0,
  "dynamicRate6": 62.0
};