var oracleData = {
  "time": "2026-10-07 21:32:32",
  "issue": "2026280",
  "code": "1,26,28,29,3,5,15",
  "zodiac": "马,蛇,兔,虎,龙,虎,龙",
  "wave": "red,blue,green,red,blue,green,blue",
  "teSx": "龙",
  "teWei": "5",
  "nextIssue": "2026281",
  "ninePool": [
    "马",
    "猴",
    "鸡",
    "狗",
    "鼠",
    "牛",
    "羊",
    "猪",
    "蛇"
  ],
  "sixPool": [
    "马",
    "猴",
    "鸡",
    "狗",
    "鼠",
    "牛"
  ],
  "killZodiacs": [
    "虎",
    "龙"
  ],
  "rangeZodiacs": [
    "马",
    "猴",
    "鸡",
    "狗",
    "鼠",
    "牛",
    "羊",
    "猪",
    "蛇"
  ],
  "numbers": [
    1,
    11,
    46,
    9,
    7,
    6,
    18,
    10,
    30,
    21,
    31,
    13
  ],
  "zodiacNumMap": {
    "马": [
      1,
      13
    ],
    "猴": [
      11
    ],
    "鸡": [
      46,
      10
    ],
    "狗": [
      9,
      21
    ],
    "鼠": [
      7,
      31
    ],
    "牛": [
      6,
      18,
      30
    ]
  },
  "top7Tails": [
    6,
    8,
    0,
    1,
    3,
    4,
    7
  ],
  "dynamicRate9": 72.0,
  "dynamicRate6": 56.00000000000001
};