var oracleData = {
  "time": "2026-06-30 21:32:32",
  "issue": "2026181",
  "code": "17,29,6,34,47,15,19",
  "zodiac": "虎,虎,牛,鸡,猴,龙,鼠",
  "wave": "green,red,green,red,blue,blue,red",
  "teSx": "鼠",
  "teWei": "9",
  "nextIssue": "2026182",
  "ninePool": [
    "猴",
    "马",
    "牛",
    "虎",
    "龙",
    "鸡",
    "猪",
    "兔",
    "蛇"
  ],
  "sixPool": [
    "猴",
    "马",
    "牛",
    "虎",
    "龙",
    "鸡"
  ],
  "killZodiacs": [
    "猪",
    "鼠"
  ],
  "rangeZodiacs": [
    "猴",
    "马",
    "牛",
    "虎",
    "龙",
    "鸡",
    "猪",
    "兔",
    "蛇"
  ],
  "numbers": [
    23,
    13,
    42,
    17,
    3,
    22,
    47,
    37,
    27,
    29,
    39,
    30
  ],
  "zodiacNumMap": {
    "猴": [
      23,
      47
    ],
    "马": [
      13,
      37
    ],
    "牛": [
      42,
      30
    ],
    "虎": [
      17,
      29
    ],
    "龙": [
      3,
      27,
      39
    ],
    "鸡": [
      22
    ]
  },
  "top7Tails": [
    2,
    3,
    7,
    9,
    0,
    5,
    1
  ],
  "dynamicRate9": 79.48717948717949,
  "dynamicRate6": 61.53846153846154
};