var oracleData = {
  "time": "2026-06-23 21:32:32",
  "issue": "2026174",
  "code": "15,8,34,13,28,21,41",
  "zodiac": "龙,猪,鸡,马,兔,狗,虎",
  "wave": "blue,red,red,red,green,green,blue",
  "teSx": "虎",
  "teWei": "1",
  "nextIssue": "2026175",
  "ninePool": [
    "猴",
    "鸡",
    "马",
    "龙",
    "狗",
    "猪",
    "兔",
    "牛",
    "羊"
  ],
  "sixPool": [
    "猴",
    "鸡",
    "马",
    "龙",
    "狗",
    "猪"
  ],
  "killZodiacs": [
    "猴",
    "虎"
  ],
  "rangeZodiacs": [
    "猴",
    "鸡",
    "马",
    "龙",
    "狗",
    "猪",
    "兔",
    "牛",
    "羊"
  ],
  "numbers": [
    47,
    10,
    37,
    27,
    9,
    20,
    22,
    32,
    11,
    1,
    21,
    35
  ],
  "zodiacNumMap": {
    "猴": [
      47,
      11,
      35
    ],
    "鸡": [
      10,
      22
    ],
    "马": [
      37,
      1
    ],
    "龙": [
      27
    ],
    "狗": [
      9,
      21
    ],
    "猪": [
      20,
      32
    ]
  },
  "top7Tails": [
    0,
    2,
    7,
    1,
    5,
    8,
    9
  ],
  "dynamicRate9": 78.125,
  "dynamicRate6": 59.375
};