var oracleData = {
  "time": "2026-09-01 21:32:32",
  "issue": "2026244",
  "code": "9,14,3,17,33,40,46",
  "zodiac": "狗,蛇,龙,虎,狗,兔,鸡",
  "wave": "blue,blue,blue,green,green,red,red",
  "teSx": "鸡",
  "teWei": "6",
  "nextIssue": "2026245",
  "ninePool": [
    "牛",
    "兔",
    "蛇",
    "猪",
    "龙",
    "鼠",
    "猴",
    "虎",
    "马"
  ],
  "sixPool": [
    "牛",
    "兔",
    "蛇",
    "猪",
    "龙",
    "鼠"
  ],
  "killZodiacs": [
    "虎",
    "鸡"
  ],
  "rangeZodiacs": [
    "牛",
    "兔",
    "蛇",
    "猪",
    "龙",
    "鼠",
    "猴",
    "虎",
    "马"
  ],
  "numbers": [
    6,
    4,
    14,
    8,
    3,
    43,
    30,
    40,
    20,
    44,
    16,
    26
  ],
  "zodiacNumMap": {
    "牛": [
      6,
      30
    ],
    "兔": [
      4,
      40,
      16
    ],
    "蛇": [
      14,
      26
    ],
    "猪": [
      8,
      20,
      44
    ],
    "龙": [
      3
    ],
    "鼠": [
      43
    ]
  },
  "top7Tails": [
    0,
    3,
    4,
    6,
    8,
    5,
    1
  ],
  "dynamicRate9": 86.0,
  "dynamicRate6": 50.0
};