var oracleData = {
  "time": "2026-10-15 21:32:32",
  "issue": "2026288",
  "code": "14,48,5,17,46,21,25",
  "zodiac": "蛇,羊,虎,虎,鸡,狗,马",
  "wave": "blue,blue,green,green,red,green,blue",
  "teSx": "马",
  "teWei": "5",
  "nextIssue": "2026289",
  "ninePool": [
    "狗",
    "虎",
    "鼠",
    "牛",
    "龙",
    "兔",
    "猪",
    "蛇",
    "鸡"
  ],
  "sixPool": [
    "狗",
    "虎",
    "鼠",
    "牛",
    "龙",
    "兔"
  ],
  "killZodiacs": [
    "龙",
    "马"
  ],
  "rangeZodiacs": [
    "狗",
    "虎",
    "鼠",
    "牛",
    "龙",
    "兔",
    "猪",
    "蛇",
    "鸡"
  ],
  "numbers": [
    21,
    17,
    7,
    6,
    27,
    16,
    41,
    31,
    33,
    43,
    3,
    4
  ],
  "zodiacNumMap": {
    "狗": [
      21,
      33
    ],
    "虎": [
      17,
      41
    ],
    "鼠": [
      7,
      31,
      43
    ],
    "牛": [
      6
    ],
    "龙": [
      27,
      3
    ],
    "兔": [
      16,
      4
    ]
  },
  "top7Tails": [
    1,
    6,
    7,
    3,
    4,
    5,
    9
  ],
  "dynamicRate9": 74.0,
  "dynamicRate6": 56.00000000000001
};